{
  "backend/main.mo": "Motoko actor defining story, user, and draft types with storage and authorization mixins plus a dummy stories list and map-based state.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Collection of prewritten summaries describing the purpose of various frontend files.",
  "frontend/index.css": "Tailwind base styles and theme variable definitions for light and dark modes using OKLCH channel values.",
  "frontend/index.html": "Main HTML entry point configuring PWA metadata, icons, theme colors, and loading the React app root.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, categories, and display settings.",
  "frontend/public/sw.js": "Service worker implementing install, activate, messaging, and fetch handlers with caching strategies for app shell and assets.",
  "frontend/src/App.tsx": "Root app component setting up routing, theme, splash screen, and global providers, with logic for drawer, onboarding, scroll reset, and service worker.",
  "frontend/src/components/AdPlaceholder.tsx": "Renders a basic ad container unless user is premium or in preview, offering a button to navigate to the premium page with error logging.",
  "frontend/src/components/AppButton.tsx": "Wrapper around shadcn Button enforcing consistent styling across variants and sizes to prevent CSS regressions.",
  "frontend/src/components/AppDrawer.tsx": "Slide‑in navigation drawer listing main app routes, premium CTA, and error‑handled navigation with fallbacks.",
  "frontend/src/components/AppHeader.tsx": "Top header with menu button, centered logo with fallback, and user avatar pulled from profile data.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar with route buttons, highlighting the active tab and handling navigation failures.",
  "frontend/src/components/ButtonStyleRegressionCheck.tsx": "Dev‑only floating panel rendering multiple button variants for quick visual verification of styling.",
  "frontend/src/components/CategoryScroller.tsx": "Horizontal category scroller that navigates to encoded category pages, filtered by preferences and kids mode.",
  "frontend/src/components/ContinueReadingCard.tsx": "Shows the user's last-read story with cover, progress, and click-to-continue navigation.",
  "frontend/src/components/DailyStoryNotificationBanner.tsx": "Displays a dismissible daily story banner that hides for 24 hours once dismissed.",
  "frontend/src/components/InstallPromptBanner.tsx": "Prompts users to install the PWA when installable, with install and dismiss actions.",
  "frontend/src/components/InterstitialAdModal.tsx": "Shows an interstitial ad modal with a countdown unless the user is premium or in preview mode.",
  "frontend/src/components/LanguageSelector.tsx": "Provides a dropdown for selecting the app's UI language.",
  "frontend/src/components/LegalSupportPageLayout.tsx": "Page layout with a back button, styled content container, and footer for legal/support pages.",
  "frontend/src/components/LoginButton.tsx": "Handles login/logout via Internet Identity and updates query cache accordingly.",
  "frontend/src/components/ModeToggle.tsx": "Switches between adults and kids viewing modes.",
  "frontend/src/components/MyStoryCard.tsx": "Displays a user's story with cover, metadata, and buttons to edit or read.",
  "frontend/src/components/MyStoryDraftCard.tsx": "Shows a draft story preview with image (if any) and relative creation time.",
  "frontend/src/components/NavDebugOverlay.tsx": "Debug overlay listing navigation failures with options to clear or close.",
  "frontend/src/components/onboarding/OnboardingFlow.tsx": "Controls a 3-step onboarding wizard that updates language, age mode, and theme, with forward/back navigation, skip handling, and transition animations.",
  "frontend/src/components/onboarding/StepTransition.tsx": "Provides direction-based enter animations for onboarding steps, with reduced-motion support.",
  "frontend/src/components/PageLayout.tsx": "Generic page layout wrapper providing spacing and optional title.",
  "frontend/src/components/PremiumBadge.tsx": "Renders a premium badge with different visual variants using icons and gradient styles.",
  "frontend/src/components/ReadingControls.tsx": "Provides a popover with controls for font size, background color, and auto‑scroll settings.",
  "frontend/src/components/ReminderBanner.tsx": "Shows a dismissible reminder banner based on stored display logic.",
  "frontend/src/components/RequireAuth.tsx": "Guards content behind authentication and prompts users to log in if not authenticated.",
  "frontend/src/components/RouteErrorFallback.tsx": "Displays a styled 404/error fallback with diagnostics logging and navigation options.",
  "frontend/src/components/ShareSheetPlaceholder.tsx": "Handles story sharing via Web Share API or clipboard fallback with success/error toasts.",
  "frontend/src/components/SplashScreen.tsx": "Shows the app splash screen with animated logo, taglines, and a loading indicator.",
  "frontend/src/components/StoryCard.tsx": "Displays a story preview card with navigation, favorites, likes, and basic story metadata.",
  "frontend/src/components/StoryCardSkeleton.tsx": "Provides a skeleton placeholder layout for loading story cards.",
  "frontend/src/components/TopBanner.tsx": "Renders a dismissible top banner with variants and optional icon and description.",
  "frontend/src/components/TranslateBanner.tsx": "Shows a banner offering translation and displays a placeholder message after translating.",
  "frontend/src/components/UserAvatar.tsx": "Displays a user avatar with fallback initials, error handling, and optional loading overlay.",
  "frontend/src/context/PreferencesContext.tsx": "Manages user preference state (language, mode, font settings, etc.) with localStorage persistence and backend sync.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, automatically refreshing dependent queries on identity change.",
  "frontend/src/hooks/useAppUser.ts": "Handles user profile state for both authenticated and guest users, syncing with backend and supporting optimistic premium updates.",
  "frontend/src/hooks/useFavorites.ts": "Provides fetching and toggling of favorite stories, supporting both authenticated backend storage and guest localStorage mode.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity login, storage, identity restoration, and state tracking via a React context provider.",
  "frontend/src/hooks/useMyStories.ts": "Fetches user's story drafts from backend or localStorage, filtering expired entries and sorting by newest first.",
  "frontend/src/hooks/useOfflineDownloads.ts": "Manages offline story downloads using localStorage, converting bigint fields and tracking downloaded story IDs.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects the user's prefers-reduced-motion setting and updates on changes via matchMedia.",
  "frontend/src/hooks/usePwaInstallPrompt.ts": "Handles PWA install prompt readiness, dismissal logic, and showing the installation dialog.",
  "frontend/src/hooks/useReadingHistory.ts": "Tracks story reading history for guests or authenticated users, storing progress and last-read entries.",
  "frontend/src/hooks/useStories.ts": "Provides React Query hooks to fetch stories, categories, and featured items from backend with seeded fallbacks.",
  "frontend/src/hooks/useStoryEditor.ts": "Creates new stories or drafts, uploading images if authenticated or saving locally for guests.",
  "frontend/src/hooks/useStorySocial.ts": "Manages likes and comments for a story using local storage-backed social data.",
  "frontend/src/hooks/useUserProfile.ts": "Retrieves and updates user profiles for authenticated or guest users, handling image blobs and fallbacks.",
  "frontend/src/index.css": "Defines global Tailwind styles, color themes, dark mode variables, focus states, and animation utilities.",
  "frontend/src/lib/covers.ts": "Returns cover image URLs based on category and kid-friendly mode, with fallbacks.",
  "frontend/src/lib/engagement.ts": "Manages engagement data including streaks, badges, shares, and persistence in localStorage.",
  "frontend/src/lib/fonts.ts": "Maps UI languages to CSS font classes with a default fallback.",
  "frontend/src/lib/i18n.ts": "Defines supported UI languages and localized UI strings for each language.",
  "frontend/src/lib/kidsMode.ts": "Provides kids-safe category filtering and defines mature and kid-friendly category lists.",
  "frontend/src/lib/logOnce.ts": "Logs warnings or errors only once per session keyed by identifier.",
  "frontend/src/lib/navFailures.ts": "Tracks recent navigation failures in sessionStorage with helpers to record, retrieve, and clear them.",
  "frontend/src/lib/notifications.ts": "Wraps browser notification permissions and shows a test notification when allowed.",
  "frontend/src/lib/onboarding.ts": "Stores and retrieves onboarding completion state in localStorage.",
  "frontend/src/lib/profileValidation.ts": "Validates usernames and image files/URLs for profile input.",
  "frontend/src/lib/readingProgress.ts": "Saves, loads, and clears per-story reading progress in localStorage and computes scroll percentage.",
  "frontend/src/lib/reminders.ts": "Handles reminder settings, checks if reminders should show, and records last shown time.",
  "frontend/src/lib/routerSearch.ts": "Safely converts search objects to query strings and builds full paths with search parameters.",
  "frontend/src/lib/seededStories.ts": "Provides seeded fallback stories, cover image selection, and kids-mode filtering.",
  "frontend/src/lib/share.ts": "Provides sharing utilities for app and stories using Web Share API with clipboard fallback and structured result types.",
  "frontend/src/lib/storyDraft.ts": "Validates story form inputs, computes word counts and read time, and manages locally stored story tags.",
  "frontend/src/lib/storyLanguage.ts": "Maps UI languages to backend languages and retrieves story content or translation availability accordingly.",
  "frontend/src/lib/storySocialStorage.ts": "Handles localStorage-based likes overlays and comments for individual stories.",
  "frontend/src/lib/translatePlaceholder.ts": "Generates placeholder translated story content using English as a fallback.",
  "frontend/src/lib/uiPolish.ts": "Defines shared UI constants for sizing, spacing, layout, transitions, and styling presets.",
  "frontend/src/lib/urlParams.ts": "Detects preview mode and safely encodes/decodes category IDs for URLs.",
  "frontend/src/lib/userProfileStorage.ts": "Manages guest profile persistence in localStorage with migration support for older formats.",
  "frontend/src/lib/userStoriesStorage.ts": "Stores and prunes expiring guest story drafts in localStorage with add and delete helpers.",
  "frontend/src/main.tsx": "App entry point initializing React, Internet Identity provider, and React Query client.",
  "frontend/src/pages/AboutUs.tsx": "Renders the About Us page with basic description and navigation back button.",
  "frontend/src/pages/CategoriesTab.tsx": "Displays filtered categories with cover images and navigation, handling encoded category IDs.",
  "frontend/src/pages/CategoryDetail.tsx": "Loads stories for a given category ID, handling invalid IDs and showing up to 10 items.",
  "frontend/src/pages/FavoritesTab.tsx": "Displays the user's favorite stories with loading placeholders and an empty state message when none exist.",
  "frontend/src/pages/GoPremium.tsx": "Shows premium subscription plans, benefits, and handles simulated subscription flow before navigating to the success page.",
  "frontend/src/pages/HelpAndSupport.tsx": "Provides troubleshooting tips, contact info, social links, and a small credits section within a legal/support layout.",
  "frontend/src/pages/HomeTab.tsx": "Renders the home screen with featured stories, latest stories, ads, notifications, and language/theme controls.",
  "frontend/src/pages/MyStories.tsx": "Allows users to view and create story drafts, showing loading skeletons and an empty state when no drafts exist.",
  "frontend/src/pages/PremiumSuccess.tsx": "Displays a confirmation screen after successful subscription with a benefits list and navigation options.",
  "frontend/src/pages/PrivacyPolicy.tsx": "Shows the app's privacy policy detailing data collection, ads, children's policy, and contact info.",
  "frontend/src/pages/ProfileTab.tsx": "User profile page with editing, authentication handling, navigation safety, and listing of user's story drafts and stats.",
  "frontend/src/pages/SearchTab.tsx": "Search interface that filters and sorts all stories based on user query and language.",
  "frontend/src/pages/StoryEditor.tsx": "Story creation form supporting text, emojis, image upload, validation, and submission.",
  "frontend/src/pages/StoryReader.tsx": "Story reading view with offline downloads, likes, comments, sharing, progress tracking, and customizable reading settings.",
  "frontend/src/pages/TermsAndConditions.tsx": "Static legal page displaying terms of use and contact details.",
  "frontend/src/pwa/registerServiceWorker.ts": "Service worker registration logic with preview-mode bypass, update handling, cache clearing, and auto-refresh.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors via CSS variables, safelisted utility classes, and plugins including typography, container queries, and animations.",
  "project_state.json": "Project metadata describing the Stories app requirements, existing features, architectural notes, known issues, and image needs for ongoing build fixes."
}