{
  "backend/main.mo": "Motoko canister defining story, user, and profile types with access‑controlled CRUD operations and mixins for auth and blob storage.",
  "feature_evidence.json": "Feature evidence report listing onboarding, navigation, and PWA cache‑fix features with related files and metadata.",
  "frontend-file-summaries.txt": "Plaintext mapping of frontend file paths to short summaries describing their functionality and recent fixes.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color tokens and light/dark theme variables for global styling.",
  "frontend/index.html": "HTML entry point loading the app root, PWA manifest, meta tags, and main script.",
  "frontend/public/manifest.webmanifest": "PWA manifest specifying app metadata, icons, colors, categories, and display mode.",
  "frontend/public/sw.js": "Service worker implementing cache version v6 with app‑shell caching, network‑first navigation, and stale‑while‑revalidate for assets.",
  "frontend/src/App.tsx": "Main React app with TanStack Router, splash and onboarding flow, service worker registration, and route layout logic.",
  "frontend/src/components/AdPlaceholder.tsx": "Shows a simple ad placeholder unless the user is premium or in preview mode, rendering a banner or inline variant.",
  "frontend/src/components/AppButton.tsx": "Provides a wrapped button with enforced style variants and size options to prevent production styling regressions.",
  "frontend/src/components/AppDrawer.tsx": "Renders a left-side navigation drawer with main links, optional story creation, and a premium upsell section.",
  "frontend/src/components/AppHeader.tsx": "Displays the top app header with a menu button, logo, and user avatar loaded from the profile hook.",
  "frontend/src/components/BottomNav.tsx": "Implements a fixed bottom tab bar with navigation icons, labels, and active-state detection.",
  "frontend/src/components/ButtonStyleRegressionCheck.tsx": "Dev‑only panel rendering multiple AppButton variants to visually detect styling issues.",
  "frontend/src/components/CategoryScroller.tsx": "Shows a horizontal scrollable list of categories filtered by mode and navigates to the selected category.",
  "frontend/src/components/ContinueReadingCard.tsx": "Displays the user's most recently read story with cover, progress indicator, and quick navigation.",
  "frontend/src/components/DailyStoryNotificationBanner.tsx": "Shows a dismissible banner announcing the daily featured story and hides itself for 24 hours after dismissal.",
  "frontend/src/components/InstallPromptBanner.tsx": "Prompts users to install the PWA when installable, offering install and dismiss actions.",
  "frontend/src/components/InterstitialAdModal.tsx": "Displays an interstitial ad modal with a countdown unless the user is premium or in preview mode.",
  "frontend/src/components/LanguageSelector.tsx": "Provides a dropdown to switch the app's language using the preferences context.",
  "frontend/src/components/LegalSupportPageLayout.tsx": "Page layout with a back button, wrapper card, and footer for legal/support pages.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button using Internet Identity with query clearing and localized labels.",
  "frontend/src/components/ModeToggle.tsx": "Toggle buttons to switch between adults and kids reading modes.",
  "frontend/src/components/MyStoryCard.tsx": "Displays a user's story with cover, summary, metadata, and edit/read actions.",
  "frontend/src/components/onboarding/OnboardingFlow.tsx": "Implements a three‑step onboarding wizard that saves language, mode, and theme preferences.",
  "frontend/src/components/onboarding/StepTransition.tsx": "Provides direction‑aware animated transitions for onboarding steps with reduced‑motion support.",
  "frontend/src/components/PageLayout.tsx": "Generic page layout wrapper with optional title and standardized spacing.",
  "frontend/src/components/PremiumBadge.tsx": "Renders different variants of a premium badge using crown icon and gradient styles.",
  "frontend/src/components/ReadingControls.tsx": "Popover with controls for font size, background theme, and auto-scroll settings.",
  "frontend/src/components/ReminderBanner.tsx": "Shows a dismissible top banner reminding users about new stories.",
  "frontend/src/components/RequireAuth.tsx": "Gatekeeper component that prompts login if the user isn't authenticated.",
  "frontend/src/components/RouteErrorFallback.tsx": "Fallback UI for route errors with message and button to return home.",
  "frontend/src/components/ShareSheetPlaceholder.tsx": "Share button supporting Web Share API or link copy with toast feedback and share tracking.",
  "frontend/src/components/SplashScreen.tsx": "Fullscreen splash screen with app icon, branding, taglines, and loading indicator.",
  "frontend/src/components/StoryCard.tsx": "Story preview card supporting featured and normal modes with navigation and premium handling.",
  "frontend/src/components/StoryCardSkeleton.tsx": "Renders a skeleton placeholder layout for a story card using multiple Skeleton components.",
  "frontend/src/components/TopBanner.tsx": "Displays a dismissible top banner with variant styles, optional icon, and title/description.",
  "frontend/src/components/TranslateBanner.tsx": "Shows a translation prompt banner with a translate button and a temporary placeholder message after use.",
  "frontend/src/components/UserAvatar.tsx": "Renders a user avatar with fallback icon, size variants, and optional loading overlay.",
  "frontend/src/context/PreferencesContext.tsx": "Manages user preference state such as language, mode, and reading settings with persistence and auto‑detection.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to identity, refetching dependent queries on change.",
  "frontend/src/hooks/useAppUser.ts": "Handles user state from backend or guest storage, including preferences, premium status, and updates.",
  "frontend/src/hooks/useFavorites.ts": "Fetches and toggles favorite stories using backend actor and react‑query with cache updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling login, stored identity loading, and status flags.",
  "frontend/src/hooks/useMyStories.ts": "Fetches the authenticated user's stories using the backend actor if supported, falling back to an empty list.",
  "frontend/src/hooks/useOfflineDownloads.ts": "Implements localStorage‑based offline story downloads, providing functions to save, remove, and retrieve stories.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects and subscribes to the user's prefers‑reduced‑motion setting using a media query listener.",
  "frontend/src/hooks/usePwaInstallPrompt.ts": "Manages the PWA install prompt, including deferred events, dismissal timing, and triggering installation.",
  "frontend/src/hooks/useReadingHistory.ts": "Tracks reading history for guests via localStorage and authenticated users via app state, supporting progress updates and retrieval.",
  "frontend/src/hooks/useStories.ts": "Provides queries for fetching filtered story lists, single stories, and the daily featured story from the backend.",
  "frontend/src/hooks/useStoryEditor.ts": "Handles loading and saving stories through the backend actor, supporting creation, updates, and cache invalidation.",
  "frontend/src/hooks/useUserProfile.ts": "Fetches and updates user profiles for authenticated users via backend and for guests via localStorage, returning unified profile data.",
  "frontend/src/index.css": "Defines Tailwind layers, theme color variables for light/dark modes, global focus and button styles, and onboarding animation utilities.",
  "frontend/src/lib/covers.ts": "Provides helper to return cover image URLs based on category and kid-friendly mode.",
  "frontend/src/lib/engagement.ts": "Manages engagement data in localStorage including streaks, badges, shares, and bonus story unlocks.",
  "frontend/src/lib/fonts.ts": "Maps UI languages to corresponding font utility classes.",
  "frontend/src/lib/i18n.ts": "Defines supported languages and localized UI strings for the app interface.",
  "frontend/src/lib/kidsMode.ts": "Provides kids-mode category filtering and checks for kid-safe categories.",
  "frontend/src/lib/notifications.ts": "Utility for checking notification permissions and showing test notifications.",
  "frontend/src/lib/onboarding.ts": "Handles storing and checking onboarding completion state in localStorage.",
  "frontend/src/lib/profileValidation.ts": "Validates usernames and image inputs for profile settings.",
  "frontend/src/lib/readingProgress.ts": "Saves, loads, clears, and calculates story reading progress from localStorage.",
  "frontend/src/lib/reminders.ts": "Manages reminder settings and determines whether daily reminders should be shown.",
  "frontend/src/lib/share.ts": "Implements sharing utilities for app and stories with Web Share API and clipboard fallback.",
  "frontend/src/lib/storyDraft.ts": "Provides word counting, read-time calculation, story form validation, and localStorage helpers for saving and loading story tags.",
  "frontend/src/lib/storyLanguage.ts": "Maps UI languages to backend languages and retrieves story content or translation availability based on language.",
  "frontend/src/lib/translatePlaceholder.ts": "Generates placeholder translated story content using English as fallback.",
  "frontend/src/lib/uiPolish.ts": "Defines shared UI constants for sizes, spacing, layout, transitions, and styling tokens.",
  "frontend/src/lib/urlParams.ts": "Provides helpers for detecting preview mode and encoding/decoding category IDs for URLs.",
  "frontend/src/lib/userProfileStorage.ts": "Manages guest profile persistence in localStorage with get, save, and clear utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity providers.",
  "frontend/src/pages/AboutUs.tsx": "Displays static About Us page content with navigation back to home.",
  "frontend/src/pages/CategoriesTab.tsx": "Shows a grid of categories with covers and handles navigation to category detail pages.",
  "frontend/src/pages/CategoryDetail.tsx": "Loads and displays stories for a category with language and mode filtering plus navigation.",
  "frontend/src/pages/FavoritesTab.tsx": "Displays user's favorited stories or placeholders when empty or loading.",
  "frontend/src/pages/GoPremium.tsx": "Renders premium subscription page with plan selection, benefits, and simulated subscription flow.",
  "frontend/src/pages/HelpAndSupport.tsx": "Shows help tips, contact info, social links, and support information within a styled layout.",
  "frontend/src/pages/HomeTab.tsx": "Fetches and displays featured stories, categories, latest stories, ads, and notification banners on the home tab.",
  "frontend/src/pages/PremiumSuccess.tsx": "Shows a confirmation screen after premium activation with benefits and navigation buttons.",
  "frontend/src/pages/PrivacyPolicy.tsx": "Renders the app’s privacy policy content inside a legal-themed layout.",
  "frontend/src/pages/ProfileTab.tsx": "Displays user profile info, authentication controls, badges, and user-created stories.",
  "frontend/src/pages/SearchTab.tsx": "Provides story search with filtering, sorting, and results listing using user-selected language.",
  "frontend/src/pages/StoryEditor.tsx": "Offers a full editor for creating or editing stories with fields, validation, image upload, and read-time calculation.",
  "frontend/src/pages/StoryReader.tsx": "Interactive story reader with language selection, scroll tracking, progress persistence, favorites, sharing, and offline download handling.",
  "frontend/src/pages/TermsAndConditions.tsx": "Static terms-and-conditions page rendered inside a legal layout.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers and manages the service worker with update checks, skip-waiting, and auto-reload on activation.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, persisting them in sessionStorage, and cleaning hash-based params.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with safelisted classes, custom colors, themes, and plugins.",
  "project_state.json": "Project state describing requirements to fix onboarding navigation and PWA caching issues."
}