{
  "backend/main.mo": "Main backend actor defining story data models, user profiles, access control checks, and user management APIs like get/save profile and create/get user.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of various frontend components, pages, hooks, and assets.",
  "frontend/index.css": "Tailwind base/theme definitions with OKLCH variables and light/dark mode styling for global UI.",
  "frontend/index.html": "HTML entry point setting up PWA metadata, icons, theme color, and bootstrapping the React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining metadata, icons, display mode, and categories for Global Tales.",
  "frontend/public/sw.js": "Service worker handling caching, offline support, and network-first strategies for app shell and assets.",
  "frontend/src/App.tsx": "Main React app wiring routes, splash/onboarding flow, PWA registration, drawer state, and layout logic for full-screen pages.",
  "frontend/src/components/AdPlaceholder.tsx": "Shows an ad placeholder unless the user is premium, with banner or inline variants.",
  "frontend/src/components/AppDrawer.tsx": "Side drawer menu with navigation links and premium status or upsell section.",
  "frontend/src/components/AppHeader.tsx": "Top header with menu button, centered app icon, and user avatar loaded from profile.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with translated labels and active tab highlighting.",
  "frontend/src/components/CategoryScroller.tsx": "Scrollable horizontal list of categories filtered by mode with navigation on click.",
  "frontend/src/components/ContinueReadingCard.tsx": "Card showing the last read story with title, author, cover, and progress bar.",
  "frontend/src/components/DailyStoryNotificationBanner.tsx": "Dismissible banner announcing the daily story, hidden for 24 hours after dismissal.",
  "frontend/src/components/InstallPromptBanner.tsx": "PWA install prompt banner with install button and dismiss option.",
  "frontend/src/components/InterstitialAdModal.tsx": "Modal showing an interstitial ad placeholder with a countdown before continuing, hidden for premium users.",
  "frontend/src/components/LanguageSelector.tsx": "Dropdown selector for choosing the app language from supported options.",
  "frontend/src/components/LegalSupportPageLayout.tsx": "Layout wrapper for legal/support pages with back button and footer.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button using Internet Identity with loading and error handling.",
  "frontend/src/components/ModeToggle.tsx": "Toggle allowing users to switch between adults and kids modes.",
  "frontend/src/components/onboarding/OnboardingFlow.tsx": "Runs a multi-step onboarding flow for language, mode, and theme selection with transitions.",
  "frontend/src/components/onboarding/StepTransition.tsx": "Provides directional slide/fade animations for transitioning between onboarding steps.",
  "frontend/src/components/PremiumBadge.tsx": "Premium indicator with multiple visual variants including icon-only and compact.",
  "frontend/src/components/ReadingControls.tsx": "Provides popover controls for font size, reading background, and auto-scroll using user preferences.",
  "frontend/src/components/ReminderBanner.tsx": "Shows a dismissible banner reminding users of new stories based on reminder logic.",
  "frontend/src/components/ShareSheetPlaceholder.tsx": "Handles story sharing via Web Share API or link copying, with toasts and engagement tracking.",
  "frontend/src/components/SplashScreen.tsx": "Displays an animated splash screen with app icon, branding, taglines, and loader.",
  "frontend/src/components/StoryCard.tsx": "Renders a clickable story card (featured or standard) with image, metadata, and premium lock state.",
  "frontend/src/components/TranslateBanner.tsx": "Shows a banner offering placeholder translation if a story isn’t available in the selected language.",
  "frontend/src/components/UserAvatar.tsx": "Displays user avatar with fallback, size options, and loading overlay.",
  "frontend/src/context/PreferencesContext.tsx": "Provides a React context for UI preferences, syncing state with user data and browser defaults.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useAppUser.ts": "Manages authenticated and guest user state, syncing with backend and localStorage.",
  "frontend/src/hooks/useFavorites.ts": "Handles favorite story toggling for authenticated and guest users using backend or localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, and identity state management via AuthClient.",
  "frontend/src/hooks/useOfflineDownloads.ts": "Implements offline story storage using localStorage with bigint serialization.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects the user's prefers-reduced-motion OS setting and updates on changes.",
  "frontend/src/hooks/usePwaInstallPrompt.ts": "Manages PWA install prompt handling, dismissal persistence, and triggering the prompt.",
  "frontend/src/hooks/useReadingHistory.ts": "Manages reading history for authenticated and guest users with localStorage fallback.",
  "frontend/src/hooks/useStories.ts": "Provides React Query hooks to fetch stories, individual story data, and the daily featured story.",
  "frontend/src/hooks/useUserProfile.ts": "Handles authenticated and guest user profile retrieval and saving using React Query and localStorage.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, multi-language fonts, and UI animation keyframes.",
  "frontend/src/lib/covers.ts": "Returns cover image URLs based on category and kid-friendly mode.",
  "frontend/src/lib/engagement.ts": "Stores and updates engagement metrics like streaks, shares, badges, and bonus story unlocks in localStorage.",
  "frontend/src/lib/fonts.ts": "Maps UI languages to corresponding font class names.",
  "frontend/src/lib/i18n.ts": "Provides supported languages list and localized UI string dictionaries.",
  "frontend/src/lib/kidsMode.ts": "Defines kid-safe categories and filters category lists based on kids mode.",
  "frontend/src/lib/notifications.ts": "Utility helpers for browser notification capability, permission handling, and test notifications.",
  "frontend/src/lib/onboarding.ts": "Tracks onboarding completion status using localStorage.",
  "frontend/src/lib/profileValidation.ts": "Validates usernames and profile images or URLs for profile updates.",
  "frontend/src/lib/reminders.ts": "Manages reminder settings and last-shown timestamps in localStorage with helpers to decide when to show reminders.",
  "frontend/src/lib/share.ts": "Provides sharing utilities for app and stories with Web Share API support and clipboard fallbacks.",
  "frontend/src/lib/storyLanguage.ts": "Maps UI languages to backend languages and retrieves story content or translation availability.",
  "frontend/src/lib/translatePlaceholder.ts": "Generates placeholder translated story content using English as fallback.",
  "frontend/src/lib/uiPolish.ts": "Defines shared UI styling constants like sizes, spacing, and button configurations.",
  "frontend/src/lib/userProfileStorage.ts": "Handles guest profile persistence in localStorage with get, save, and clear functions.",
  "frontend/src/main.tsx": "Initializes the React app root with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/AboutUs.tsx": "Renders the About Us page with navigation and descriptive text about the platform.",
  "frontend/src/pages/CategoriesTab.tsx": "Displays a grid of story categories with covers and navigation to category details.",
  "frontend/src/pages/CategoryDetail.tsx": "Shows stories within a category with language filtering, loading states, and mode toggle.",
  "frontend/src/pages/FavoritesTab.tsx": "Lists the user's favorited stories or shows an empty-state message.",
  "frontend/src/pages/GoPremium.tsx": "Displays premium subscription options, benefits, and handles mock subscription state.",
  "frontend/src/pages/HelpAndSupport.tsx": "Provides help tips, contact info, social links, and a support-themed layout.",
  "frontend/src/pages/HomeTab.tsx": "Main home screen fetching featured and latest stories, showing ads, categories, and notification banner.",
  "frontend/src/pages/PremiumSuccess.tsx": "Displays confirmation of premium upgrade with benefits list and navigation buttons.",
  "frontend/src/pages/PrivacyPolicy.tsx": "Static privacy policy page outlining data practices, ads, children policy, contact, and updates.",
  "frontend/src/pages/ProfileTab.tsx": "User profile page with editing, notifications, sharing, validation, and engagement features.",
  "frontend/src/pages/SearchTab.tsx": "Search interface filtering stories by text and sort order with loading states.",
  "frontend/src/pages/StoryReader.tsx": "Story reading view with fetching, favorites, downloads, auto-scroll, and reading preferences.",
  "frontend/src/pages/TermsAndConditions.tsx": "Static terms page detailing usage rules, premium notes, and contact info.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers service worker on load and checks for updates periodically.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL or hash parameters, persist them in sessionStorage, and clear them from the URL.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, layout, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines project metadata, existing features, pending requests, and the overall iterative polish goals for the app."
}