{
  "backend/main.mo": "Defines the main canister with story, user, and profile types, storage mixins, and seeded stories.",
  "backend/migration.mo": "Provides a migration function converting old user profiles to new ones with displayName and username.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to related files, components, and tests.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for numerous frontend files used for build planning.",
  "frontend/index.css": "Defines Tailwind base styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Main HTML entry file configuring PWA metadata, icons, and root app mount.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining name, icons, theme colors, orientation, and categories.",
  "frontend/public/sw.js": "Service worker handling install, activation, caching, and fetch strategies for offline support.",
  "frontend/src/App.tsx": "Sets up global app layout, routing, splash screen, service worker, and conditional layouts for story and premium pages.",
  "frontend/src/components/AdPlaceholder.tsx": "Renders a placeholder ad unless the user is premium or in preview mode, with a button linking to the premium page.",
  "frontend/src/components/AppButton.tsx": "Custom button wrapper enforcing consistent variant and size styling around shadcn UI Button.",
  "frontend/src/components/AppDrawer.tsx": "Side drawer menu providing navigation links, premium CTA, and error‑handled routing.",
  "frontend/src/components/AppHeader.tsx": "Top header with menu button, centered logo, and user avatar with fallback behavior.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar with active‑state highlighting and safe navigation handling.",
  "frontend/src/components/ButtonStyleRegressionCheck.tsx": "Dev‑only widget rendering various button variants to detect styling regressions.",
  "frontend/src/components/CategoryScroller.tsx": "Horizontally scrollable category list that navigates to category detail pages.",
  "frontend/src/components/ContinueReadingCard.tsx": "Displays the user’s last-read story with progress and links back to the story reader.",
  "frontend/src/components/DailyStoryNotificationBanner.tsx": "Dismissible 24‑hour notification banner for daily featured story alerts.",
  "frontend/src/components/InstallPromptBanner.tsx": "Shows a PWA install prompt banner with install and dismiss actions when the app is installable.",
  "frontend/src/components/InterstitialAdModal.tsx": "Displays a timed interstitial ad modal unless the user is premium or in preview mode.",
  "frontend/src/components/LanguageSelector.tsx": "Provides a dropdown to select the app’s language from supported options.",
  "frontend/src/components/LegalSupportPageLayout.tsx": "Layout wrapper for legal/support pages with a back button and footer branding.",
  "frontend/src/components/LoginButton.tsx": "Handles login/logout via Internet Identity and updates UI based on authentication state.",
  "frontend/src/components/ModeToggle.tsx": "Switches between adults and kids content modes using preference settings.",
  "frontend/src/components/MyStoryCard.tsx": "Displays a user’s story card with cover, details, and actions to edit or read.",
  "frontend/src/components/onboarding/OnboardingFlow.tsx": "Manages a three‑step onboarding flow for language, mode, and theme, persisting preferences and supporting skip.",
  "frontend/src/components/onboarding/StepTransition.tsx": "Wraps onboarding steps with direction‑aware enter animations, disabling motion when preferred.",
  "frontend/src/components/PageLayout.tsx": "Generic page layout providing max-width container, spacing, and optional title.",
  "frontend/src/components/PremiumBadge.tsx": "Renders a premium badge in multiple style variants.",
  "frontend/src/components/ReadingControls.tsx": "Popover with controls for font size, reading background, and auto-scroll preferences.",
  "frontend/src/components/ReminderBanner.tsx": "Shows a reminder banner based on local reminder logic with dismiss handling.",
  "frontend/src/components/RequireAuth.tsx": "Guards content behind authentication and shows a login prompt when needed.",
  "frontend/src/components/RouteErrorFallback.tsx": "Fallback page for routing errors with a message and button to return home.",
  "frontend/src/components/ShareSheetPlaceholder.tsx": "Provides share or copy-link functionality with Web Share API fallback and feedback.",
  "frontend/src/components/SplashScreen.tsx": "Full-screen splash view showing app icon, name, taglines, and loading indicator.",
  "frontend/src/components/StoryCard.tsx": "Displays a story card with title, summary, cover, metadata, and favorite toggle, navigating to the story on click.",
  "frontend/src/components/StoryCardSkeleton.tsx": "Shows a skeleton placeholder layout mimicking a story card while content loads.",
  "frontend/src/components/TopBanner.tsx": "Renders a dismissible top banner with variants, optional icon, title, and description.",
  "frontend/src/components/TranslateBanner.tsx": "Provides a banner offering placeholder translation with a button, switching to a notice after activation.",
  "frontend/src/components/UserAvatar.tsx": "Displays a user avatar with image, initials fallback, optional loading overlay, and size variants.",
  "frontend/src/context/PreferencesContext.tsx": "Stores and persists user UI preferences with localStorage and syncs them to backend user state when available.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to identity, reinitializing and invalidating dependent queries on change.",
  "frontend/src/hooks/useAppUser.ts": "Combines guest and authenticated user state, syncing to the backend, handling optimistic premium updates, and storing notification prefs.",
  "frontend/src/hooks/useFavorites.ts": "Manages favorite stories with React Query and localStorage, supporting both authenticated users via backend calls and guests via client-side storage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling identity loading, login, logout, and AuthClient setup.",
  "frontend/src/hooks/useMyStories.ts": "Fetches the authenticated user’s stories via backend if supported, otherwise returns an empty list.",
  "frontend/src/hooks/useOfflineDownloads.ts": "Handles offline story downloads using localStorage, supporting save, remove, fetch, and download-state tracking.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects and subscribes to the browser's prefers-reduced-motion setting.",
  "frontend/src/hooks/usePwaInstallPrompt.ts": "Manages the PWA install prompt lifecycle, including showing, dismissing, and cooldown tracking.",
  "frontend/src/hooks/useReadingHistory.ts": "Tracks reading history and progress for both authenticated users and guests, storing data in user state or localStorage.",
  "frontend/src/hooks/useStories.ts": "Provides various story-fetching hooks with seeded fallbacks, filtering, language/mode handling, and backend queries.",
  "frontend/src/hooks/useStoryEditor.ts": "Offers story loading and a placeholder save function, currently blocking creation with a 'coming soon' error.",
  "frontend/src/hooks/useStorySocial.ts": "Manages story likes and comments using local storage–backed social data utilities.",
  "frontend/src/hooks/useUserProfile.ts": "React hook that loads authenticated or guest user profile data, exposes derived profile info, and provides a mutation for saving profile changes.",
  "frontend/src/index.css": "Tailwind-based global CSS defining color variables, dark mode theming, focus styles, and animation utilities.",
  "frontend/src/lib/covers.ts": "Maps story categories to cover image URLs with separate handling for kid‑friendly categories.",
  "frontend/src/lib/engagement.ts": "Manages engagement metrics in localStorage, including streaks, badges, shares, and bonus unlocks.",
  "frontend/src/lib/fonts.ts": "Returns the appropriate font class name based on the selected UI language.",
  "frontend/src/lib/i18n.ts": "Defines supported UI languages and translation strings for app interface text.",
  "frontend/src/lib/kidsMode.ts": "Provides helpers to determine kid‑safe categories and filter category lists based on kids mode.",
  "frontend/src/lib/logOnce.ts": "Logs warnings or errors only once per session using a keyed cache.",
  "frontend/src/lib/notifications.ts": "Utilities for checking notification support, requesting permission, and sending a test notification.",
  "frontend/src/lib/onboarding.ts": "Manages onboarding completion state via localStorage with helpers to check, set, and reset it.",
  "frontend/src/lib/profileValidation.ts": "Validates usernames and image inputs for profile editing with size, type, and format checks.",
  "frontend/src/lib/readingProgress.ts": "Stores, loads, clears, and computes reading progress data per story using localStorage.",
  "frontend/src/lib/reminders.ts": "Manages reminder settings in localStorage and determines when to show reminders based on a 24‑hour interval.",
  "frontend/src/lib/seededStories.ts": "Provides seeded fallback stories and utilities for filtering by kids mode and selecting local cover images by category.",
  "frontend/src/lib/share.ts": "Implements app and story sharing via Web Share API with clipboard fallbacks and standardized share result handling.",
  "frontend/src/lib/storyDraft.ts": "Validates story draft input, calculates word count and read time, and stores per‑story tags in localStorage.",
  "frontend/src/lib/storyLanguage.ts": "Maps UI languages to backend language enums and retrieves appropriate story content with translation checks.",
  "frontend/src/lib/storySocialStorage.ts": "Stores likes and comments for stories in localStorage with helpers to read, update, and toggle like overlays.",
  "frontend/src/lib/translatePlaceholder.ts": "Generates placeholder translated story content using English as fallback with marked translated fields.",
  "frontend/src/lib/uiPolish.ts": "Defines shared UI styling constants for sizing, spacing, layout, transitions, and component presets.",
  "frontend/src/lib/urlParams.ts": "Provides helpers for detecting preview mode and encoding or decoding category IDs for URLs.",
  "frontend/src/lib/userProfileStorage.ts": "Handles guest profile persistence in localStorage with migration from older formats.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/AboutUs.tsx": "Renders the About Us page with basic project information and a back button.",
  "frontend/src/pages/CategoriesTab.tsx": "Displays a grid of categories with cover images and navigation handling, respecting kids mode and translations.",
  "frontend/src/pages/CategoryDetail.tsx": "Displays stories for a decoded category ID with loading states and a back button.",
  "frontend/src/pages/FavoritesTab.tsx": "Shows the user’s favorited stories or an empty state if none are saved.",
  "frontend/src/pages/GoPremium.tsx": "Renders premium plan selection, benefits, and subscription flow with simulated processing.",
  "frontend/src/pages/HelpAndSupport.tsx": "Provides help tips, contact info, social links, and a small footer note.",
  "frontend/src/pages/HomeTab.tsx": "Shows featured story, categories, continue reading, ads, and latest stories with loading states.",
  "frontend/src/pages/PremiumSuccess.tsx": "Displays confirmation of premium activation with benefits and navigation options.",
  "frontend/src/pages/PrivacyPolicy.tsx": "Presents the app’s privacy policy sections including data collection and contact info.",
  "frontend/src/pages/ProfileTab.tsx": "Manages user profile display, editing, authentication, stats, and user-created stories.",
  "frontend/src/pages/SearchTab.tsx": "Implements a searchable and sortable story list with filtering, loading states, and StoryCard rendering.",
  "frontend/src/pages/StoryEditor.tsx": "Provides a full story creation/editing form with cover upload, read-time calculation, validation, and save logic.",
  "frontend/src/pages/StoryReader.tsx": "Displays a story reader with font/background controls, favorites, social actions, offline support, and reading progress tracking.",
  "frontend/src/pages/TermsAndConditions.tsx": "Renders static terms and conditions content inside a legal page layout.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker, handles updates, triggers reloads, and checks for new versions periodically.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, including hash-based parsing.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, safelist classes, plugins, and color variables.",
  "project_state.json": "Defines the project state, known issues, required image assets, and existing feature fixes related to modes, stories, social actions, and profile fields. Serves as a configuration and tracking record for the project's current fix requests and features."
}