{
  "backend/main.mo": "Motoko backend defining stories, users, profiles, access control, and core CRUD/query methods with authorization checks.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files for reference in build planning.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark color tokens and global styling.",
  "frontend/index.html": "HTML entrypoint setting PWA metadata, icons, and root mount for the React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest describing app metadata, icons, theme colors, and categories.",
  "frontend/public/sw.js": "Service worker implementing app-shell caching, network-first navigation, and cache-first asset handling.",
  "frontend/src/App.tsx": "Main React app wiring routes, splash screen, onboarding, drawer, PWA worker registration, and layout logic.",
  "frontend/src/components/AdPlaceholder.tsx": "Displays an ad block unless the user is premium, supporting banner and inline variants.",
  "frontend/src/components/AppDrawer.tsx": "Side navigation drawer showing user info, menu links, and premium upsell for non‑premium users.",
  "frontend/src/components/AppHeader.tsx": "Top header with menu button, app logo, and user avatar fetched from profile data.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar with localized tabs and active-state highlighting.",
  "frontend/src/components/CategoryScroller.tsx": "Horizontally scrollable category list filtered by mode, navigating to category pages.",
  "frontend/src/components/ContinueReadingCard.tsx": "Shows last-read story with progress and navigation to resume reading.",
  "frontend/src/components/DailyStoryNotificationBanner.tsx": "Dismissible banner announcing a new daily story, hidden for 24 hours after dismissal.",
  "frontend/src/components/InstallPromptBanner.tsx": "Prompts users to install the PWA with an install button and dismiss option.",
  "frontend/src/components/InterstitialAdModal.tsx": "Modal showing an interstitial ad placeholder with a countdown before continuing.",
  "frontend/src/components/LanguageSelector.tsx": "Dropdown to select app language from supported options.",
  "frontend/src/components/LegalSupportPageLayout.tsx": "Layout wrapper for legal/support pages with back navigation and footer.",
  "frontend/src/components/LoginButton.tsx": "Handles Internet Identity login/logout with status-based button labeling.",
  "frontend/src/components/ModeToggle.tsx": "Toggle to switch between adults and kids content modes.",
  "frontend/src/components/onboarding/OnboardingFlow.tsx": "Guides users through a three‑step onboarding flow to set language, mode, and theme, with transitions and skip support.",
  "frontend/src/components/onboarding/StepTransition.tsx": "Provides direction‑aware animated transitions between onboarding steps with reduced‑motion support.",
  "frontend/src/components/PremiumBadge.tsx": "Renders premium status badges in multiple visual variants.",
  "frontend/src/components/ReadingControls.tsx": "Provides a popover with controls for font size, background theme, and auto‑scroll settings using user preferences.",
  "frontend/src/components/ReminderBanner.tsx": "Displays a dismissible reminder banner based on reminder state and hides it once dismissed.",
  "frontend/src/components/ShareSheetPlaceholder.tsx": "Shows a share button that triggers async story sharing, records engagement, and shows toast feedback.",
  "frontend/src/components/SplashScreen.tsx": "Renders the full‑screen animated splash screen with app branding, fallback icon, and loading indicator.",
  "frontend/src/components/StoryCard.tsx": "Displays a story preview card or featured card with localized title, metadata, and premium indicators; navigates to story on click.",
  "frontend/src/components/TranslateBanner.tsx": "Shows a banner offering placeholder translation and updates UI after translation is triggered.",
  "frontend/src/components/UserAvatar.tsx": "Renders a user avatar with optional image, fallback icon, size variants, and a loading overlay.",
  "frontend/src/context/PreferencesContext.tsx": "Manages global user preferences such as language, mode, font size, background, and persists updates to user state.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useAppUser.ts": "Manages authenticated and guest user profiles, syncing preferences and premium status with the backend or localStorage.",
  "frontend/src/hooks/useFavorites.ts": "Handles favorite story toggling and retrieval for authenticated users via backend or guests via localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication state and actions using Internet Identity, loading stored identities and managing login flow.",
  "frontend/src/hooks/useOfflineDownloads.ts": "Stores stories offline in localStorage, enabling download, retrieval, and removal with bigint-safe serialization.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects and tracks the user's prefers‑reduced‑motion setting via a media query listener.",
  "frontend/src/hooks/usePwaInstallPrompt.ts": "Captures the PWA install prompt event, handles user dismissal timing, and exposes installation actions.",
  "frontend/src/hooks/useReadingHistory.ts": "Tracks reading history per user or guest, storing entries in backend or localStorage and providing progress helpers.",
  "frontend/src/hooks/useStories.ts": "Fetches stories, single story details, and the daily featured story from the backend using filtering options.",
  "frontend/src/hooks/useUserProfile.ts": "React hook that loads and saves user or guest profiles using React Query, local storage, and backend actors.",
  "frontend/src/index.css": "Tailwind-based global styles defining themes, fonts, safe-area helpers, and various animation keyframes.",
  "frontend/src/lib/covers.ts": "Returns a cover image URL based on story category and kid-friendly mode.",
  "frontend/src/lib/engagement.ts": "Manages engagement stats such as streaks, badges, shares, and bonus unlocks via localStorage.",
  "frontend/src/lib/fonts.ts": "Maps UI language codes to corresponding font CSS classes.",
  "frontend/src/lib/i18n.ts": "Defines supported languages and UI string translations for each language.",
  "frontend/src/lib/kidsMode.ts": "Provides kids-mode filtering and checks for whether categories are kid‑safe.",
  "frontend/src/lib/notifications.ts": "Utility wrapper for browser Notification API including permission checks and test notifications.",
  "frontend/src/lib/onboarding.ts": "Stores and retrieves onboarding completion status in localStorage.",
  "frontend/src/lib/profileValidation.ts": "Validates usernames and profile images/URLs for size, type, and formatting.",
  "frontend/src/lib/reminders.ts": "Handles reminder settings, daily reminder cooldowns, and persistence via localStorage.",
  "frontend/src/lib/share.ts": "Provides Web Share API and clipboard fallback utilities plus helpers to share app or story URLs.",
  "frontend/src/lib/storyLanguage.ts": "Maps UI language to backend language and retrieves story content or translation availability.",
  "frontend/src/lib/translatePlaceholder.ts": "Generates placeholder translated story content using English as fallback.",
  "frontend/src/lib/userProfileStorage.ts": "Manages guest profile persistence in localStorage with get, save, and clear utilities.",
  "frontend/src/main.tsx": "Initializes React app with query client and Internet Identity provider.",
  "frontend/src/pages/AboutUs.tsx": "Renders the About Us page with basic app description and navigation.",
  "frontend/src/pages/CategoriesTab.tsx": "Displays category grid filtered by mode with localized titles and navigation.",
  "frontend/src/pages/CategoryDetail.tsx": "Shows stories in a selected category with language filtering, mode toggle, and loading states.",
  "frontend/src/pages/FavoritesTab.tsx": "Lists favorited stories or shows an empty‑state message.",
  "frontend/src/pages/GoPremium.tsx": "Premium upgrade page with plan selection, benefits list, and simulated subscription handling.",
  "frontend/src/pages/HelpAndSupport.tsx": "Help and support page with troubleshooting tips, contact info, and social links.",
  "frontend/src/pages/HomeTab.tsx": "Home dashboard showing featured story, categories, continue reading, ads, and latest stories.",
  "frontend/src/pages/PremiumSuccess.tsx": "Displays a premium subscription success screen with benefits and navigation buttons.",
  "frontend/src/pages/PrivacyPolicy.tsx": "Renders the app's privacy policy using a legal layout component.",
  "frontend/src/pages/ProfileTab.tsx": "Manages user profile editing, notifications, sharing, and premium/account status.",
  "frontend/src/pages/SearchTab.tsx": "Implements story search with filtering, sorting, and story list display.",
  "frontend/src/pages/StoryReader.tsx": "Handles story reading UI with language selection, favorites, downloads, and auto-scroll.",
  "frontend/src/pages/TermsAndConditions.tsx": "Shows the terms and conditions content using the shared legal layout.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker and checks for updates periodically.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata listing deployed features, polishing goals, and pending enhancement requests for premium, sharing, and notifications."
}