{
  "backend/main.mo": "Motoko canister managing stories, user profiles, and AppUser state with access control, profile storage, and user creation/query functions.",
  "feature_evidence.json": "Feature evidence report listing implemented premium subscription flow requirements and related files/components.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files describing their roles in routing, UI, user state, and PWA behavior.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables for light/dark themes and applying global background/foreground rules.",
  "frontend/index.html": "HTML entry point setting PWA metadata, icons, theme colors, and mounting the root React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest specifying app metadata, icons, categories, and standalone display settings.",
  "frontend/public/sw.js": "Service worker providing offline caching with network-first navigation and cache-first asset strategies.",
  "frontend/src/App.tsx": "Main React app configuring router, splash and onboarding flows, layout, and service worker registration.",
  "frontend/src/components/AdPlaceholder.tsx": "Shows a placeholder ad unless the user is premium, with banner or inline sizing.",
  "frontend/src/components/AppDrawer.tsx": "Side drawer showing profile info and navigation links, adjusting for premium users.",
  "frontend/src/components/AppHeader.tsx": "Top header with menu button, app icon, and user avatar fetched from profile.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar with translated tab labels and active‑route highlighting.",
  "frontend/src/components/CategoryScroller.tsx": "Horizontally scrollable category list filtered by mode and localized by language.",
  "frontend/src/components/ContinueReadingCard.tsx": "Displays the user’s most recent story with progress and navigation to continue reading.",
  "frontend/src/components/DailyStoryNotificationBanner.tsx": "Shows a dismissible banner for daily story updates, hidden for 24 hours after dismissal.",
  "frontend/src/components/InstallPromptBanner.tsx": "Prompts users to install the PWA with install and dismiss actions.",
  "frontend/src/components/InterstitialAdModal.tsx": "Modal showing an interstitial ad with a countdown before allowing close.",
  "frontend/src/components/LanguageSelector.tsx": "Dropdown allowing selection of app language from supported options.",
  "frontend/src/components/LegalSupportPageLayout.tsx": "Layout wrapper for legal/support pages with back navigation and footer.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button handling Internet Identity auth and clearing queries on logout.",
  "frontend/src/components/ModeToggle.tsx": "Toggle for switching between adults and kids reading modes.",
  "frontend/src/components/onboarding/OnboardingFlow.tsx": "Manages the multi-step onboarding process for selecting language, mode, and theme, with transitions and skip logic.",
  "frontend/src/components/onboarding/StepTransition.tsx": "Handles directional slide and fade animations for onboarding step transitions with reduced-motion support.",
  "frontend/src/components/ReadingControls.tsx": "Reading settings popover for font size, background theme, and auto‑scroll options.",
  "frontend/src/components/ReminderBanner.tsx": "Displays a reminder banner when allowed, dismissible and tracked in storage.",
  "frontend/src/components/ShareSheetPlaceholder.tsx": "Provides a share button that triggers story sharing, records engagement, and shows a bonus toast if unlocked.",
  "frontend/src/components/SplashScreen.tsx": "Displays the app splash screen with logo, taglines, loading indicator, and fallback icon handling.",
  "frontend/src/components/StoryCard.tsx": "Renders a story preview card with cover, title, metadata, premium indicators, and navigation on click.",
  "frontend/src/components/TranslateBanner.tsx": "Shows a banner when a story lacks translation and triggers a placeholder translation when clicked.",
  "frontend/src/components/UserAvatar.tsx": "Displays a user avatar with optional image, fallback icon, size presets, and loading overlay.",
  "frontend/src/context/PreferencesContext.tsx": "Provides user preference state (language, mode, font, etc.), initializes from user data or browser language, and persists updates.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on authentication identity, reinitializing and invalidating queries on identity change.",
  "frontend/src/hooks/useAppUser.ts": "Manages authenticated or guest user state, syncing with backend when logged in and localStorage otherwise.",
  "frontend/src/hooks/useFavorites.ts": "Handles favorite story management for authenticated users via backend and guests via localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading identities, handling login flow, and exposing auth state.",
  "frontend/src/hooks/useOfflineDownloads.ts": "Stores downloaded stories offline using localStorage, allowing saving, removing, and retrieving stories.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects and tracks the user's prefers‑reduced‑motion system setting.",
  "frontend/src/hooks/usePwaInstallPrompt.ts": "Captures the PWA install prompt event, manages dismissal timing, and exposes install trigger functions.",
  "frontend/src/hooks/useReadingHistory.ts": "Tracks reading history for users, using backend for authenticated users and localStorage for guests.",
  "frontend/src/hooks/useStories.ts": "Fetches stories, a single story, or a daily featured story from the backend with filtering options.",
  "frontend/src/hooks/useUserProfile.ts": "React hook managing user or guest profiles with fetch, transform, and save logic including image handling.",
  "frontend/src/index.css": "Global Tailwind-based styles defining themes, fonts, safe-area handling, and animation keyframes.",
  "frontend/src/lib/covers.ts": "Returns story cover image URLs based on category and kid-friendly mode.",
  "frontend/src/lib/engagement.ts": "Handles engagement tracking such as streaks, badges, shares, and localStorage persistence.",
  "frontend/src/lib/fonts.ts": "Maps UI language codes to corresponding font CSS classes.",
  "frontend/src/lib/i18n.ts": "Defines supported UI languages and localized UI strings.",
  "frontend/src/lib/kidsMode.ts": "Provides kid-safe category filtering and checks for mature content.",
  "frontend/src/lib/notifications.ts": "Utilities for checking, requesting, and showing browser notifications.",
  "frontend/src/lib/onboarding.ts": "Tracks onboarding completion state in localStorage.",
  "frontend/src/lib/profileValidation.ts": "Validates usernames and profile images or URLs for profile updates.",
  "frontend/src/lib/reminders.ts": "Manages reminder settings, cooldown checks, and last-shown timestamps via localStorage.",
  "frontend/src/lib/share.ts": "Provides sharing utilities using Web Share API with clipboard fallbacks and helpers to share app or story URLs.",
  "frontend/src/lib/storyLanguage.ts": "Maps UI language to backend language and retrieves appropriate story content or translation availability.",
  "frontend/src/lib/translatePlaceholder.ts": "Generates placeholder translated story content by modifying English text with markers.",
  "frontend/src/lib/userProfileStorage.ts": "Manages guest profile persistence in localStorage with get, save, and clear helpers.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AboutUs.tsx": "Renders an About Us page with introductory text about the app.",
  "frontend/src/pages/CategoriesTab.tsx": "Displays a grid of story categories with covers and navigation links.",
  "frontend/src/pages/CategoryDetail.tsx": "Shows stories within a selected category with loading states and mode toggle.",
  "frontend/src/pages/FavoritesTab.tsx": "Displays the user's favorited stories or an empty-state message.",
  "frontend/src/pages/GoPremium.tsx": "Shows premium subscription plans and enables marking the user as premium.",
  "frontend/src/pages/HelpAndSupport.tsx": "Presents help tips, contact info, and social links within a support layout.",
  "frontend/src/pages/HomeTab.tsx": "Home screen showing featured story, categories, ads, continue reading, and latest stories.",
  "frontend/src/pages/PremiumSuccess.tsx": "Displays a premium subscription success screen with benefits and navigation buttons.",
  "frontend/src/pages/PrivacyPolicy.tsx": "Renders the app’s privacy policy using a legal page layout.",
  "frontend/src/pages/ProfileTab.tsx": "Handles user profile viewing and editing, including username, avatar, sharing, and notification settings.",
  "frontend/src/pages/SearchTab.tsx": "Provides a searchable and sortable story list with filters and result display.",
  "frontend/src/pages/StoryReader.tsx": "Displays a story reader with language selection, favorites, downloads, auto-scroll, and customization options.",
  "frontend/src/pages/TermsAndConditions.tsx": "Shows the app’s terms and conditions using a legal page layout.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker and periodically checks for updates.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration defining dark mode, content paths, extended theme colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file describing the app’s goals, architecture notes, existing features, and version metadata for the Global Tales Universe app."
}