{
  "backend/main.mo": "Defines story, user, and profile types with storage and authorization mixins, and seeds initial dummy stories in a Motoko actor canister.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature IDs to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides human‑written summaries of various frontend files for reference or documentation.",
  "frontend/index.css": "Tailwind base styles defining light and dark OKLCH color tokens and applying global background and text colors.",
  "frontend/index.html": "Main HTML entry for the app with PWA metadata, icons, manifest, and root mount point.",
  "frontend/public/manifest.webmanifest": "PWA manifest describing app name, colors, icons, categories, and start behavior.",
  "frontend/public/sw.js": "Service worker implementing caching, stale‑while‑revalidate for assets, and network‑first navigation handling with cache fallback.",
  "frontend/src/App.tsx": "Main app entry sets up routing, splash screen logic, layout switching, and service worker registration. Handles global effects like scrolling, drawer preview, and special layouts for story and premium routes.",
  "frontend/src/components/AdPlaceholder.tsx": "Displays an ad placeholder unless user is premium or in preview mode, with a button to navigate to the premium page. Includes navigation error logging.",
  "frontend/src/components/AppButton.tsx": "Wrapper around shadcn Button enforcing consistent variant and size styling. Prevents style regressions and preserves button affordance across builds.",
  "frontend/src/components/AppDrawer.tsx": "Left-side navigation drawer with primary links, premium upsell, and secondary links. Handles navigation with fallback and logs failed attempts.",
  "frontend/src/components/AppHeader.tsx": "Top app header with menu button, centered logo, and user avatar. Falls back to text logo if image fails to load.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar for major app routes, highlighting active tab and handling navigation with fallbacks and logging.",
  "frontend/src/components/ButtonStyleRegressionCheck.tsx": "Dev-only widget that renders multiple button variants for visual style verification. Highlights required checks for specific routes.",
  "frontend/src/components/CategoryScroller.tsx": "Horizontally scrollable category list filtered by preferences, navigating to category detail pages. Logs navigation failures.",
  "frontend/src/components/ContinueReadingCard.tsx": "Shows a card for the user's last-read story with cover, progress, and navigation to resume reading. Handles navigation errors gracefully.",
  "frontend/src/components/DailyStoryNotificationBanner.tsx": "Shows a dismissible daily story banner, remembering dismissal for 24 hours via localStorage.",
  "frontend/src/components/InstallPromptBanner.tsx": "Displays a PWA install prompt banner with install and dismiss buttons when installable.",
  "frontend/src/components/InterstitialAdModal.tsx": "Shows an interstitial ad modal with a countdown timer unless user is premium or in preview mode.",
  "frontend/src/components/LanguageSelector.tsx": "A language dropdown allowing users to switch among supported languages.",
  "frontend/src/components/LegalSupportPageLayout.tsx": "Page layout for legal/support pages with back navigation and a footer.",
  "frontend/src/components/LoginButton.tsx": "Provides login/logout logic using Internet Identity with status handling.",
  "frontend/src/components/ModeToggle.tsx": "Toggle control to switch between adults and kids reading modes.",
  "frontend/src/components/MyStoryCard.tsx": "Displays a user's story card with cover, metadata, and buttons to read or edit.",
  "frontend/src/components/onboarding/OnboardingFlow.tsx": "Multi‑step onboarding flow to set language, mode, and theme with transitions, skipping, and persistence.",
  "frontend/src/components/onboarding/StepTransition.tsx": "Wrapper providing direction‑aware enter animations for onboarding steps, with reduced‑motion support.",
  "frontend/src/components/PageLayout.tsx": "Generic page layout wrapper with optional title and spacing.",
  "frontend/src/components/PremiumBadge.tsx": "Renders premium status badges in multiple visual variants.",
  "frontend/src/components/ReadingControls.tsx": "Popover with controls for font size, background, and auto-scroll reading preferences.",
  "frontend/src/components/ReminderBanner.tsx": "Shows a reminder banner based on reminder rules and hides after dismissal.",
  "frontend/src/components/RequireAuth.tsx": "Guards content behind authentication, prompting users to log in if needed.",
  "frontend/src/components/RouteErrorFallback.tsx": "Fallback UI for routing errors with logging and a button to return home.",
  "frontend/src/components/ShareSheetPlaceholder.tsx": "Handles story sharing via Web Share API or clipboard, with feedback and share tracking.",
  "frontend/src/components/SplashScreen.tsx": "Full‑screen splash screen showing app icon, title, taglines, and a loading spinner with fallback handling for image errors.",
  "frontend/src/components/StoryCard.tsx": "Displays a story preview card with cover, title, summary, metadata, and favorite toggle, handling navigation and like overlay logic.",
  "frontend/src/components/StoryCardSkeleton.tsx": "Skeleton placeholder UI mimicking the StoryCard layout while content is loading.",
  "frontend/src/components/TopBanner.tsx": "Configurable top banner with icon, title, optional description, and a dismiss button supporting multiple visual variants.",
  "frontend/src/components/TranslateBanner.tsx": "Banner prompting translation with a button, showing a temporary placeholder message after translating.",
  "frontend/src/components/UserAvatar.tsx": "User avatar component with image, initials fallback, load error logging, and optional loading overlay.",
  "frontend/src/context/PreferencesContext.tsx": "Preferences context managing language, mode, reading settings, and persistence via localStorage and user state sync.",
  "frontend/src/hooks/useActor.ts": "Hook creating and caching a backend actor based on identity, initializing access control, and invalidating dependent queries on change.",
  "frontend/src/hooks/useAppUser.ts": "Manages user state for authenticated and guest users, syncing preferences and premium status with backend and localStorage.",
  "frontend/src/hooks/useFavorites.ts": "Handles favorite story toggling for authenticated and guest users, syncing with backend or localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication, managing login state, stored identities, and auth client setup.",
  "frontend/src/hooks/useMyStories.ts": "Fetches the authenticated user's own stories from the backend if supported.",
  "frontend/src/hooks/useOfflineDownloads.ts": "Stores stories offline in localStorage, supporting download, removal, and retrieval with bigint-safe serialization.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects and listens for system reduced‑motion preference changes.",
  "frontend/src/hooks/usePwaInstallPrompt.ts": "Handles PWA install prompt events, dismissal logic, and triggering installation.",
  "frontend/src/hooks/useReadingHistory.ts": "Maintains reading history for authenticated and guest users, syncing with backend or localStorage.",
  "frontend/src/hooks/useStories.ts": "React Query hooks to fetch stories, featured stories, category-filtered stories, and story details with seeded fallbacks and kids-mode support.",
  "frontend/src/hooks/useStoryEditor.ts": "Provides story editing helpers including a stubbed save mutation and a loader that fetches a story from the backend.",
  "frontend/src/hooks/useStorySocial.ts": "Manages likes and comments for a story using local storage-backed social data with simple toggle and add operations.",
  "frontend/src/hooks/useUserProfile.ts": "Handles authenticated or guest user profiles, including fetching, deriving display data, and saving profile updates.",
  "frontend/src/index.css": "Tailwind-based global styles defining theme variables, dark mode values, focus behavior, and animation utilities.",
  "frontend/src/lib/covers.ts": "Returns default or category-based cover image URLs with separate mappings for kids and non-kids content.",
  "frontend/src/lib/engagement.ts": "Local storage utilities for tracking streaks, badges, shares, and engagement progress with automatic badge awarding.",
  "frontend/src/lib/fonts.ts": "Maps UI languages to corresponding font CSS classes.",
  "frontend/src/lib/i18n.ts": "Provides supported UI languages and translation string dictionaries for interface labels across multiple locales.",
  "frontend/src/lib/kidsMode.ts": "Defines mature and kids categories and filters category lists based on kids mode.",
  "frontend/src/lib/logOnce.ts": "Logs warnings or errors only once per unique key per session and provides a reset function.",
  "frontend/src/lib/notifications.ts": "Provides helpers for checking notification support, requesting permission, and showing a test notification.",
  "frontend/src/lib/onboarding.ts": "Manages onboarding state in localStorage, allowing checking, setting, and resetting completion.",
  "frontend/src/lib/profileValidation.ts": "Validates username, image files, and image URLs with size, type, and formatting rules.",
  "frontend/src/lib/readingProgress.ts": "Stores, retrieves, clears, and calculates reading progress values in localStorage.",
  "frontend/src/lib/reminders.ts": "Handles reminder settings and determines whether a reminder should be shown based on last shown time.",
  "frontend/src/lib/seededStories.ts": "Provides seeded fallback stories and utilities for cover images and filtering by kids mode.",
  "frontend/src/lib/share.ts": "Implements sharing utilities for app and stories with Web Share API or clipboard fallback.",
  "frontend/src/lib/storyDraft.ts": "Validates story draft data, calculates word count and read time, and manages local tag storage.",
  "frontend/src/lib/storyLanguage.ts": "Maps UI languages to backend languages and retrieves appropriate story content or translation availability.",
  "frontend/src/lib/storySocialStorage.ts": "Manages per-story likes and comments in localStorage including reading, updating, and adding comments.",
  "frontend/src/lib/translatePlaceholder.ts": "Generates placeholder translated story content using English as the fallback base.",
  "frontend/src/lib/uiPolish.ts": "Defines shared UI styling constants like spacing, sizes, transitions, and component presets.",
  "frontend/src/lib/urlParams.ts": "Detects preview mode and provides safe encode/decode helpers for category IDs.",
  "frontend/src/lib/userProfileStorage.ts": "Handles saving, loading, and clearing a guest user profile in localStorage with migration support for an older format.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutUs.tsx": "Displays an About Us page with basic app mission text and a back button.",
  "frontend/src/pages/CategoriesTab.tsx": "Shows a grid of filtered categories and navigates to category detail pages with click and keyboard support.",
  "frontend/src/pages/CategoryDetail.tsx": "Displays stories for a specific category with safe URL decoding, loading states, and a fallback for invalid categories.",
  "frontend/src/pages/FavoritesTab.tsx": "Shows the user's favorited stories or an empty-state message, with loading placeholders.",
  "frontend/src/pages/GoPremium.tsx": "Presents premium benefits and plan selection, simulating subscription processing and updating user state.",
  "frontend/src/pages/HelpAndSupport.tsx": "Provides troubleshooting tips, contact emails, social link, and a footer note inside a legal/support layout.",
  "frontend/src/pages/HomeTab.tsx": "Renders the home screen with featured story, categories, continue reading, ads for non-premium users, and latest stories.",
  "frontend/src/pages/PremiumSuccess.tsx": "Displays a confirmation page for activated premium status with benefits and navigation buttons.",
  "frontend/src/pages/PrivacyPolicy.tsx": "Renders the app’s privacy policy using a legal layout with sections covering data use, ads, children, and contact info.",
  "frontend/src/pages/ProfileTab.tsx": "Implements the profile page with authentication handling, profile editing, user stats, badges, and story listings.",
  "frontend/src/pages/SearchTab.tsx": "Provides a searchable and sortable story list with filtering, loading states, and story cards.",
  "frontend/src/pages/StoryEditor.tsx": "Offers a form for creating or editing stories with fields, validation, read‑time calculation, and cover image upload.",
  "frontend/src/pages/StoryReader.tsx": "Displays a full story reader with reading progress tracking, likes, comments, downloads, sharing, and appearance controls.",
  "frontend/src/pages/TermsAndConditions.tsx": "Shows the application's terms and conditions using a legal layout with usage rules and contact details.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker, handles updates, triggers page reload on activation, and periodically checks for new versions.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read URL parameters, persist them in sessionStorage, and manage hash-based query cleanup.",
  "frontend/tailwind.config.js": "Configures Tailwind with plugins, safelisted utility classes, and an extended theme including OKLCH-based color variables.",
  "project_state.json": "Describes project state, known navigation issues, and existing feature requirements for fixing route and diagnostic problems."
}