{
  "backend/main.mo": "Motoko backend actor managing users, profiles, authorization, stories, and storage with access control checks.",
  "feature_evidence.json": "Feature evidence report listing UI regression fixes, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing roles of various frontend files and components in the project.",
  "frontend/index.css": "Tailwind base styles defining OKLCH design tokens for light/dark themes and global element defaults.",
  "frontend/index.html": "Main HTML entrypoint loading the app root, PWA metadata, icons, and manifest.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, theme colors, start URL, and display settings.",
  "frontend/public/sw.js": "Service worker implementing cache v3 with network-first navigation handling and asset caching.",
  "frontend/src/App.tsx": "Root React app setting up routing, splash screen, onboarding, PWA registration, and UI layout.",
  "frontend/src/components/AdPlaceholder.tsx": "Ad placeholder component that hides for premium users and shows a styled banner or inline ad.",
  "frontend/src/components/AppDrawer.tsx": "Side drawer navigation with main links, story creation, and premium upsell handling based on user state.",
  "frontend/src/components/AppHeader.tsx": "Top app header with menu button, logo, and user avatar fetched from profile data.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom tab navigation bar with localized labels and active-state highlighting.",
  "frontend/src/components/ButtonStyleRegressionCheck.tsx": "Dev-only widget rendering multiple Button variants to visually detect styling regressions.",
  "frontend/src/components/CategoryScroller.tsx": "Horizontally scrollable category list filtered by mode and translated per language settings.",
  "frontend/src/components/ContinueReadingCard.tsx": "Card showing the user’s last-read story with progress and quick navigation to resume reading.",
  "frontend/src/components/DailyStoryNotificationBanner.tsx": "Dismissible banner announcing a new daily story, hidden for 24 hours after dismissal.",
  "frontend/src/components/InstallPromptBanner.tsx": "PWA install prompt bar offering install and dismiss actions when the app is installable.",
  "frontend/src/components/InterstitialAdModal.tsx": "Modal interstitial ad with a countdown-enabled continue button, hidden for premium users.",
  "frontend/src/components/LanguageSelector.tsx": "Dropdown selector for choosing the app’s language from supported options.",
  "frontend/src/components/LegalSupportPageLayout.tsx": "Layout wrapper for legal/support pages with back navigation and a footer.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button using Internet Identity with loading state and query cache clearing.",
  "frontend/src/components/ModeToggle.tsx": "Two-button toggle switching between adults and kids modes with localized labels.",
  "frontend/src/components/MyStoryCard.tsx": "Card displaying user's story with cover, localized title, summary, metadata, and edit/read actions.",
  "frontend/src/components/onboarding/OnboardingFlow.tsx": "Implements a three‑step onboarding UI that saves language, mode, and theme preferences and handles navigation, skipping, and completion.",
  "frontend/src/components/onboarding/StepTransition.tsx": "Wraps onboarding steps with direction‑based enter animations, respecting reduced‑motion settings.",
  "frontend/src/components/PageLayout.tsx": "Layout wrapper applying page spacing, max‑width, and optional title rendering.",
  "frontend/src/components/PremiumBadge.tsx": "Renders premium badge in multiple variants using gradient styles and crown icon.",
  "frontend/src/components/ReadingControls.tsx": "Popover with controls for font size, background theme, and auto‑scroll preferences.",
  "frontend/src/components/ReminderBanner.tsx": "Top reminder banner that appears based on local rules and can be dismissed.",
  "frontend/src/components/RequireAuth.tsx": "Gate component showing login UI when user is unauthenticated.",
  "frontend/src/components/RouteErrorFallback.tsx": "Generic error page with icon, message, and button to navigate home.",
  "frontend/src/components/ShareSheetPlaceholder.tsx": "Share button handling Web Share API or fallback link copy with toast feedback.",
  "frontend/src/components/SplashScreen.tsx": "Fullscreen loading splash with app icon, title, taglines, and spinner.",
  "frontend/src/components/StoryCard.tsx": "Story card supporting featured mode, localization, premium lock state, and read action.",
  "frontend/src/components/StoryCardSkeleton.tsx": "Skeleton placeholder mimicking story card layout during loading.",
  "frontend/src/components/TopBanner.tsx": "Dismissible top banner with variants and optional icon/description.",
  "frontend/src/components/TranslateBanner.tsx": "Banner prompting translation for unavailable languages with temporary translated state.",
  "frontend/src/components/UserAvatar.tsx": "Renders a user avatar with optional image, fallback icon, size variants, and loading overlay.",
  "frontend/src/context/PreferencesContext.tsx": "Provides a context for user interface preferences, initializes them from browser or user data, and syncs updates to backend or local state.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useAppUser.ts": "Manages authenticated or guest user state, syncing with backend when available and handling preferences, premium status, and notifications.",
  "frontend/src/hooks/useFavorites.ts": "Handles adding and removing favorite stories, using backend storage for authenticated users or local storage for guests.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout functions, and identity persistence using Dfinity AuthClient.",
  "frontend/src/hooks/useMyStories.ts": "Fetches stories created by the authenticated user using the backend actor when supported.",
  "frontend/src/hooks/useOfflineDownloads.ts": "Provides localStorage-based offline story downloads, allowing saving, removing, and retrieving stories by ID.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects the user's prefers-reduced-motion system setting and updates on changes.",
  "frontend/src/hooks/usePwaInstallPrompt.ts": "Manages the PWA install prompt, tracking installability, handling prompts, and respecting dismissal periods.",
  "frontend/src/hooks/useReadingHistory.ts": "Tracks reading history and progress for authenticated users or guests, storing data in user state or localStorage.",
  "frontend/src/hooks/useStories.ts": "Fetches story lists, individual stories, and the daily featured story via backend actor with React Query.",
  "frontend/src/hooks/useStoryEditor.ts": "Loads and saves stories through the backend, supporting creation, updates, and cache invalidation.",
  "frontend/src/hooks/useUserProfile.ts": "Fetches and saves user or guest profiles, handling images and syncing with backend or localStorage.",
  "frontend/src/index.css": "Defines Tailwind base styles, color variables, dark mode themes, animations, and accessibility focus rules.",
  "frontend/src/lib/covers.ts": "Returns a cover image URL based on story category and kid-friendly status.",
  "frontend/src/lib/engagement.ts": "Manages engagement data in localStorage, including streaks, badges, shares, and bonus story unlocks.",
  "frontend/src/lib/fonts.ts": "Maps UI languages to CSS font classes for proper text rendering.",
  "frontend/src/lib/i18n.ts": "Defines supported UI languages and provides localized UI strings for each language.",
  "frontend/src/lib/kidsMode.ts": "Provides category filtering and checks to ensure kids‑safe content visibility.",
  "frontend/src/lib/notifications.ts": "Handles notification permission checks, requests, and showing test notifications.",
  "frontend/src/lib/onboarding.ts": "Stores and retrieves onboarding completion status using localStorage.",
  "frontend/src/lib/profileValidation.ts": "Validates usernames and image inputs for user profile settings.",
  "frontend/src/lib/readingProgress.ts": "Saves, loads, and clears reading progress per story and computes scroll percentage.",
  "frontend/src/lib/reminders.ts": "Stores reminder settings and determines when daily reminders should be shown.",
  "frontend/src/lib/share.ts": "Implements sharing functions for the app and stories with Web Share API or clipboard fallback.",
  "frontend/src/lib/storyDraft.ts": "Validates story draft form data, calculates word count and read time, and stores custom tags.",
  "frontend/src/lib/storyLanguage.ts": "Maps UI languages to backend languages and selects appropriate story content or translation availability.",
  "frontend/src/lib/translatePlaceholder.ts": "Generates placeholder translated story content based on English fallback text.",
  "frontend/src/lib/uiPolish.ts": "Defines shared UI styling constants for icons, spacing, buttons, layouts, and transitions.",
  "frontend/src/lib/userProfileStorage.ts": "Utilities to get, save, and clear a guest user profile in localStorage.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, and the InternetIdentityProvider.",
  "frontend/src/pages/AboutUs.tsx": "Static About Us page with navigation back and descriptive text about the app's mission.",
  "frontend/src/pages/CategoriesTab.tsx": "Displays a grid of story categories with images and navigates to category detail pages.",
  "frontend/src/pages/CategoryDetail.tsx": "Shows stories for a selected category with loading states, mode toggle, and navigation.",
  "frontend/src/pages/FavoritesTab.tsx": "Lists favorited stories or shows an empty‑state message if none exist.",
  "frontend/src/pages/GoPremium.tsx": "Premium subscription page with benefits, plan selection, and simulated subscription flow.",
  "frontend/src/pages/HelpAndSupport.tsx": "Help and support page offering troubleshooting tips, contact emails, and social links.",
  "frontend/src/pages/HomeTab.tsx": "Home screen showing featured stories, categories, continue‑reading, ads, and latest stories.",
  "frontend/src/pages/PremiumSuccess.tsx": "Confirmation page after subscribing to Premium with benefits summary and navigation options.",
  "frontend/src/pages/PrivacyPolicy.tsx": "Page component rendering the app’s privacy policy with sections on data collection, ads, children’s privacy, contact, and policy updates.",
  "frontend/src/pages/ProfileTab.tsx": "User profile management page handling profile loading, editing, notifications, sharing, and listing user-created stories.",
  "frontend/src/pages/SearchTab.tsx": "Story search page with text filtering, sorting, and listing stories with loading states.",
  "frontend/src/pages/StoryEditor.tsx": "Story creation and editing page supporting text fields, categories, languages, image upload, and read‑time calculation.",
  "frontend/src/pages/StoryReader.tsx": "Story reading page with scrolling progress tracking, favorites, sharing, downloads, and reading preferences.",
  "frontend/src/pages/TermsAndConditions.tsx": "Page component displaying the app’s terms of use, restrictions, premium info, jurisdiction, and contact details.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers a service worker, handles updates, triggers skip‑waiting, and reloads the app when a new worker takes control.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL or hash parameters, persist them in sessionStorage, and remove them when needed.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining content paths, safelist classes, theme colors, and plugins.",
  "project_state.json": "Stores project metadata, known issues, and feature requests related to fixing missing button styling."
}