{
  "backend/main.mo": "Motoko actor managing stories, users, and profiles with access control, user creation, retrieval, and profile management.",
  "feature_evidence.json": "Feature evidence report mapping PWA and installability features to their related files and components.",
  "frontend-file-summaries.txt": "JSON mapping listing short summaries for many frontend source files used in the project.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables and light/dark theme tokens.",
  "frontend/index.html": "Main HTML entry with PWA meta tags, manifest link, icons, and mobile-optimized settings.",
  "frontend/public/manifest.webmanifest": "PWA manifest specifying app metadata, theme colors, icons, and display mode.",
  "frontend/public/sw.js": "Service worker handling install, activate, and fetch events with offline-first caching and static asset support.",
  "frontend/src/App.tsx": "Main React app wiring routes, splash screen, PWA service worker registration, and global providers.",
  "frontend/src/components/AdPlaceholder.tsx": "Simple placeholder component rendering banner and inline ad mockups while ignoring interstitial or rewarded types.",
  "frontend/src/components/BottomNav.tsx": "Renders a fixed bottom navigation bar with localized tab labels and active route highlighting.",
  "frontend/src/components/CategoryScroller.tsx": "Displays a horizontally scrollable list of categories filtered by mode and navigates to category pages.",
  "frontend/src/components/ContinueReadingCard.tsx": "Shows the user's last-read story with cover, progress bar, and navigation to resume reading.",
  "frontend/src/components/InstallPromptBanner.tsx": "Displays a PWA install banner with install and dismiss actions when the app is installable.",
  "frontend/src/components/InterstitialAdModal.tsx": "Modal showing an interstitial ad placeholder with a countdown before allowing dismissal.",
  "frontend/src/components/LanguageSelector.tsx": "Dropdown selector for choosing the app's language from supported options.",
  "frontend/src/components/LoginButton.tsx": "Button that handles Internet Identity login/logout and updates query state accordingly.",
  "frontend/src/components/ModeToggle.tsx": "Toggle buttons to switch between adults and kids reading modes.",
  "frontend/src/components/ReadingControls.tsx": "Popover with controls for font size, reading background, and auto-scroll settings.",
  "frontend/src/components/ReminderBanner.tsx": "Shows a dismissible reminder banner based on reminder logic.",
  "frontend/src/components/ShareSheetPlaceholder.tsx": "Provides share functionality using Web Share API or clipboard with engagement tracking.",
  "frontend/src/components/SplashScreen.tsx": "Full-screen splash screen with random quote and app logo.",
  "frontend/src/components/StoryCard.tsx": "Card for displaying story details, supporting featured and standard layouts with navigation.",
  "frontend/src/components/TranslateBanner.tsx": "Banner offering a placeholder translation option and showing a notice after translation.",
  "frontend/src/context/PreferencesContext.tsx": "Provides UI preference state (language, mode, font size, background, scroll, categories) synced with user accounts or local storage and auto-detects language.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, reinitializes on identity changes, and invalidates dependent queries.",
  "frontend/src/hooks/useAppUser.ts": "Manages unified user state for authenticated and guest users, syncing with backend or localStorage and exposing update helpers.",
  "frontend/src/hooks/useFavorites.ts": "Handles favorite stories for authenticated and guest users, syncing with backend or localStorage and offering toggle helpers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Wraps Internet Identity auth client, exposing identity, login/logout actions, and login status via context.",
  "frontend/src/hooks/useOfflineDownloads.ts": "Stores and retrieves offline story data in localStorage, supporting download, removal, and lookup operations.",
  "frontend/src/hooks/usePwaInstallPrompt.ts": "Handles PWA install prompt behavior, tracking dismissals and exposing functions to show or hide the prompt.",
  "frontend/src/hooks/useReadingHistory.ts": "Tracks reading history for users or guests, storing entries in backend or localStorage and providing progress helpers.",
  "frontend/src/hooks/useStories.ts": "Provides React Query hooks to fetch story lists, single stories, and the daily featured story using the actor API with filters.",
  "frontend/src/index.css": "Defines Tailwind base styles, CSS variables for theming, and font classes for multilingual support.",
  "frontend/src/lib/covers.ts": "Returns appropriate cover image URLs based on story category and kid‑friendly mode.",
  "frontend/src/lib/engagement.ts": "Manages user engagement data in localStorage including streaks, shares, badges, and progress updates.",
  "frontend/src/lib/fonts.ts": "Maps UI languages to corresponding font CSS classes.",
  "frontend/src/lib/i18n.ts": "Defines supported UI languages and localized UI string dictionaries.",
  "frontend/src/lib/kidsMode.ts": "Provides helpers to determine kid‑safe categories and filter category lists for kids mode.",
  "frontend/src/lib/reminders.ts": "Handles reminder settings and timing logic using localStorage to decide when to show reminders.",
  "frontend/src/lib/storyLanguage.ts": "Maps UI languages to backend languages and selects appropriate story content or translation availability.",
  "frontend/src/lib/translatePlaceholder.ts": "Generates placeholder translated story content by modifying the English version with markers.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and the Internet Identity provider.",
  "frontend/src/pages/CategoriesTab.tsx": "Displays filtered categories with cover images and navigation to category detail pages.",
  "frontend/src/pages/CategoryDetail.tsx": "Shows stories in a selected category using filters and language preferences, with back navigation and loading states.",
  "frontend/src/pages/FavoritesTab.tsx": "Renders the user's favorite stories or an empty‑state message with guidance.",
  "frontend/src/pages/GoPremium.tsx": "Premium purchase placeholder page with feature list and buttons to activate monthly or yearly plans.",
  "frontend/src/pages/HomeTab.tsx": "Home screen showing featured story, categories, latest stories, and ads unless user is premium.",
  "frontend/src/pages/ProfileTab.tsx": "Profile page displaying engagement stats, badges, account info, and link to premium upgrade.",
  "frontend/src/pages/SearchTab.tsx": "Search interface allowing text filtering and sorting of stories with loading and empty states.",
  "frontend/src/pages/StoryReader.tsx": "Story reading view with translations, favorites, downloads, scroll progress, and reading controls.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers service worker on load and periodically checks for updates.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters for navigation state.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom OKLCH-based colors, extended animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata describing the PWA-style Global Tales Universe app, its features, architecture notes, image requirements, and existing implemented features."
}