{
  "backend/main.mo": "Motoko canister defining story and user data models, access-controlled profile management, and CRUD-style functions for AppUser records.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of major frontend components, pages, hooks, context, and PWA files.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables, light/dark themes, and base layout styling.",
  "frontend/index.html": "HTML entry point setting up PWA meta tags, icons, manifest, and mounts the root React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest describing app metadata, theme colors, icons, and startup behavior.",
  "frontend/public/sw.js": "Service worker implementing install, activate, and fetch handlers with cache-first and network-first strategies.",
  "frontend/src/App.tsx": "Main app layout handling splash, onboarding, routing, header/drawer integration, bottom nav, and PWA setup.",
  "frontend/src/components/AdPlaceholder.tsx": "Simple component rendering placeholder UI for banner and inline ads while ignoring interstitial and rewarded types.",
  "frontend/src/components/AppDrawer.tsx": "Sliding drawer menu listing navigation items and handling route changes.",
  "frontend/src/components/AppHeader.tsx": "Top header with menu button and centered logo.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar with localized tabs and active state handling.",
  "frontend/src/components/CategoryScroller.tsx": "Scrollable horizontal list of categories filtered by mode with navigation links.",
  "frontend/src/components/ContinueReadingCard.tsx": "Displays last-read story with cover, progress, and link to resume reading.",
  "frontend/src/components/InstallPromptBanner.tsx": "PWA install banner with install and dismiss actions.",
  "frontend/src/components/InterstitialAdModal.tsx": "Modal showing an interstitial ad placeholder with a countdown before closing.",
  "frontend/src/components/LanguageSelector.tsx": "Dropdown selector for switching the app’s language.",
  "frontend/src/components/LoginButton.tsx": "Button handling login/logout via Internet Identity with status feedback.",
  "frontend/src/components/ModeToggle.tsx": "Toggle for switching between adults and kids reading modes.",
  "frontend/src/components/onboarding/OnboardingFlow.tsx": "Manages a three‑step onboarding flow for selecting language, mode, and theme with transitions and completion handling.",
  "frontend/src/components/onboarding/StepTransition.tsx": "Provides animated step‑transition logic with direction‑aware and reduced‑motion variants.",
  "frontend/src/components/ReadingControls.tsx": "Popover with controls for font size, background theme, and auto-scroll.",
  "frontend/src/components/ReminderBanner.tsx": "Temporary banner reminding users about new stories with dismiss option.",
  "frontend/src/components/ShareSheetPlaceholder.tsx": "Share button using Web Share API or clipboard fallback and tracking shares.",
  "frontend/src/components/SplashScreen.tsx": "Full-screen splash view with logo and random motivational quote.",
  "frontend/src/components/StoryCard.tsx": "Displays story preview card, with a featured variant and navigation to story.",
  "frontend/src/components/TranslateBanner.tsx": "Renders a banner prompting translation and shows a placeholder message after translating.",
  "frontend/src/context/PreferencesContext.tsx": "Defines a context for user preferences, syncing with backend or local storage and auto‑detecting initial settings.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useAppUser.ts": "Manages unified user state for guests and authenticated users, syncing with backend or local storage.",
  "frontend/src/hooks/useFavorites.ts": "Handles favorite story management for authenticated users via backend and for guests via local storage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identities, and status tracking.",
  "frontend/src/hooks/useOfflineDownloads.ts": "Manages offline story downloads using localStorage, including saving, removing, and retrieving stories with bigint handling.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects and subscribes to the user's prefers-reduced-motion setting via a media query.",
  "frontend/src/hooks/usePwaInstallPrompt.ts": "Handles PWA install prompt events, dismissal logic, and exposes actions to trigger or hide the prompt.",
  "frontend/src/hooks/useReadingHistory.ts": "Tracks reading history for guests or authenticated users, storing progress and last-read data with localStorage fallback.",
  "frontend/src/hooks/useStories.ts": "Provides React Query hooks to fetch stories, a single story, or the daily featured story from the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles, themes, fonts, and custom utility animations for the app.",
  "frontend/src/lib/covers.ts": "Returns a story cover image URL based on category and kid-friendliness.",
  "frontend/src/lib/engagement.ts": "Stores and updates engagement data such as streaks, badges, shares, and challenge progress in localStorage.",
  "frontend/src/lib/fonts.ts": "Maps UI languages to corresponding CSS font classes.",
  "frontend/src/lib/i18n.ts": "Defines supported UI languages and translation strings for interface text.",
  "frontend/src/lib/kidsMode.ts": "Determines kid-safe categories and returns category lists filtered for kids mode.",
  "frontend/src/lib/onboarding.ts": "Tracks onboarding completion state using localStorage.",
  "frontend/src/lib/reminders.ts": "Handles loading, saving, and checking reminder settings using localStorage, including 24‑hour reminder timing.",
  "frontend/src/lib/storyLanguage.ts": "Maps UI languages to backend languages and retrieves story content or checks translation availability.",
  "frontend/src/lib/translatePlaceholder.ts": "Generates placeholder translated story content by prepending markers to English text.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/CategoriesTab.tsx": "Displays a grid of categories with translated labels and navigates to category details.",
  "frontend/src/pages/CategoryDetail.tsx": "Shows stories for a selected category with loading states and kids‑mode filtering.",
  "frontend/src/pages/FavoritesTab.tsx": "Lists favorited stories or shows an empty‑state message when none exist.",
  "frontend/src/pages/GoPremium.tsx": "Renders a placeholder premium purchase flow with plan options and feature list.",
  "frontend/src/pages/HomeTab.tsx": "Shows featured stories, categories, latest stories, and ads depending on premium status.",
  "frontend/src/pages/ProfileTab.tsx": "Displays user profile, engagement stats, badges, and settings information.",
  "frontend/src/pages/SearchTab.tsx": "Provides story search with text filtering and sorting by newest or popular.",
  "frontend/src/pages/StoryReader.tsx": "React page that loads a story, manages reading state (scroll progress, translation, autoscroll), and provides actions like favorites, downloads, and navigation.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers a service worker on page load and schedules periodic update checks.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters with sessionStorage support and hash-routing compatibility.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Project metadata describing current architecture, issues, and feature requirements for adding a header and left-side drawer navigation."
}