{
  "kind": "build_request",
  "title": "Add left-side drawer navigation and header logo to the existing web PWA",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a persistent top header (app bar) to the main app layout (the layout that currently renders the BottomNav), including a left \"menu\" (hamburger) button and an app logo in the header.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "A"
        ]
      },
      "acceptanceCriteria": [
        "When the user is past Splash + Onboarding, a header is visible above the current page content.",
        "The header includes a hamburger/menu button on the left and a logo image.",
        "Header does not appear on SplashScreen or OnboardingFlow screens."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement a left-side drawer (slide-in panel) that opens when the header hamburger button is pressed and closes via an explicit close action and by selecting a navigation item.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "A"
        ]
      },
      "acceptanceCriteria": [
        "Clicking/tapping the hamburger button opens a left-side drawer.",
        "The drawer can be closed without navigation (close button or outside click) and closes after selecting a menu item.",
        "Drawer open/close behavior works on mobile and desktop widths."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add navigation menu items inside the drawer that route using TanStack Router to existing routes: Home (/), Categories (/categories), Search (/search), Favorites (/favorites), Profile (/profile), and Premium (/premium).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "A"
        ]
      },
      "acceptanceCriteria": [
        "Each drawer menu item navigates to the correct existing route using TanStack Router navigation APIs.",
        "The current route is visually indicated as active inside the drawer menu.",
        "No routes are removed or renamed."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Ensure the new header + drawer integration does not break existing bottom navigation behavior and that the main content area layout accounts for the header height (no content hidden under the header).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "A"
        ]
      },
      "acceptanceCriteria": [
        "BottomNav remains visible and functional as before.",
        "Main page content is scrollable and not obscured by the new header.",
        "StoryReader and other full-screen experiences still render correctly with the new layout."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Use an existing or generated static logo asset for the header logo and reference it as a static file from the frontend (not via the backend), consistent with the PWA manifest icon path conventions used in the project.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "A"
        ]
      },
      "acceptanceCriteria": [
        "The header logo is served as a static asset (e.g., under frontend/public/assets/generated).",
        "The app builds successfully without requiring any backend changes to serve the logo.",
        "Logo renders crisply in both light and dark themes (no unreadable blending)."
      ]
    }
  ],
  "constraints": [
    "Do not rebuild the project as an Expo/React Native app; implement the drawer and header in the existing React web (PWA) app.",
    "Do not edit any files under frontend/src/components/ui (compose existing UI components instead).",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx (immutable paths).",
    "Keep backend as a single Motoko actor; no backend changes are required for this UI-only request."
  ],
  "nonGoals": [
    "Adding new backend APIs or persistence for drawer state.",
    "Changing the existing route structure or adding new app sections beyond the drawer links.",
    "Implementing any Expo/React Native-specific navigation patterns (e.g., Expo Router, gesture handler)."
  ],
  "imageRequirements": {
    "required": [
      "Simple app logo mark, clean geometric book/globe motif, transparent background (gtu-logo.dim_512x512.png 512x512)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}