{
  "kind": "build_request",
  "title": "Fix remaining \"Page Not Found / Page currently not available\" navigation failures in draft preview",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Audit all in-app navigation entry points (bottom navigation, side drawer menu, category chips/buttons, story cards, continue-reading, profile-related links) and ensure every navigation target uses a valid TanStack Router route path that exists in `frontend/src/App.tsx` routeTree (no stale/typo paths). Replace any string-built paths with route-template navigation (e.g., `navigate({ to: '/story/$storyId', params: { storyId } })`) where applicable to prevent mismatches.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "This page currently not available and this page currently show \"Page Not Found\" please check fix this problem"
        ]
      },
      "acceptanceCriteria": [
        "Tapping each BottomNav tab (Home/Categories/Search/Favorites/Profile) never renders the \"Page Not Found\" screen.",
        "Tapping Categories (from Home category scroller and Categories tab grid) always opens the Category Detail screen for that category.",
        "Tapping any story card (Featured, Latest, Category Detail, Search results, Favorites, Continue Reading) always opens the Story Reader screen."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Make route param parsing resilient so invalid/malformed params do not crash the route into the router error/not-found fallback. In particular, harden Story Reader param handling so a non-numeric `storyId` cannot throw (e.g., safe parsing with a controlled fallback UI that offers a \"Go Home\" action). Apply similar safety for categoryId decoding in Category Detail if decode fails.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "This page currently not available and this page currently show \"Page Not Found\""
        ]
      },
      "acceptanceCriteria": [
        "Navigating to an invalid story route (e.g., `/story/not-a-number`) shows a friendly in-app error state (in English) with a working button to return to Home, and does not render a blank page.",
        "Navigating to an invalid category route (e.g., `/categories/%` or an undecodable value) shows a friendly in-app error state (in English) with a working button to return to Categories/Home, and does not render a blank page."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add lightweight runtime diagnostics for navigation failures: when navigation throws or a not-found route is shown, log a single concise error (using the existing `logOnce` pattern) that includes the attempted path and current location, so broken links can be identified quickly in preview without spamming logs.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "please check fix this problem"
        ]
      },
      "acceptanceCriteria": [
        "If a navigation attempt fails (exception), the app logs a single `logOnce` entry including the target path.",
        "If the RouteErrorFallback is rendered, the app logs a single `logOnce` entry including the current pathname/search that led to it."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under `frontend/src/components/ui` (shadcn components) or other paths listed in `frontend.immutablePaths`.",
    "Keep routing implemented with TanStack Router (do not introduce a different router)."
  ],
  "nonGoals": [
    "Implementing new app features unrelated to routing stability (e.g., payments, new content types).",
    "Adding third-party analytics or external logging services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}