{
  "kind": "build_request",
  "title": "Enhance and polish Premium, Sharing, and Notifications UX across the app",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Polish the Premium experience end-to-end (Go Premium, Premium Success, Profile, and Drawer) to feel more complete and consistent: improve copy/layout hierarchy, add clearer plan comparison and selection feedback, prevent accidental double-taps on Subscribe, and make Premium status + cancellation UX clearer while preserving the existing fake subscription behavior (no real payments).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "All enhance"
        ]
      },
      "acceptanceCriteria": [
        "Go Premium page has clearer plan presentation (Monthly vs Yearly) with consistent spacing/typography and improved visual hierarchy while keeping the same prices (₹99 monthly, ₹799 yearly) and placeholder disclaimer.",
        "Tapping Subscribe Now cannot trigger multiple navigations/updates from rapid repeated clicks (button shows a temporary loading/disabled state).",
        "Premium Success page provides clear next actions and keeps messaging consistent with existing success text intent.",
        "Profile shows an explicit Premium status section when isPremium=true (e.g., current plan label + benefits recap) and a clearer cancel flow (e.g., confirmation step) that still sets isPremium=false and updates UI immediately.",
        "Drawer and Profile Premium badge/crown styling remains consistent and legible in both light/dark themes."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Enhance ad-removal and premium gating polish: ensure every ad placement in the UI is consistently hidden for premium users, and make any premium-only story UI states feel intentional and user-friendly (no awkward placeholders).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "All enhance"
        ]
      },
      "acceptanceCriteria": [
        "When isPremium=true, no AdPlaceholder renders anywhere it is used (banner or inline).",
        "Premium-related story indicators (e.g., StoryCard premium UI) are visually consistent with the Premium theme and do not show confusing lock/placeholder states.",
        "Switching between Free and Premium updates the UI immediately without requiring a refresh (ads, badges, premium indicators update instantly)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Polish app sharing UX for both “Share App” and “Share Story”: improve user feedback, handle cancellations/errors gracefully, and make the copy-link fallback more explicit and discoverable when system sharing is unavailable.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "All enhance"
        ]
      },
      "acceptanceCriteria": [
        "Profile “Invite Friends – Share App” provides clear user feedback for success vs. cancel vs. failure (no silent failures).",
        "If Web Share API is unavailable, the UI offers an explicit copy-link action (not just an implicit fallback) and confirms success with a toast.",
        "Story share (ShareSheetPlaceholder/shareStory) includes: title, optional preview text when available, and a stable story URL when possible; the shared text formatting is readable in common share targets.",
        "Share actions do not block the UI indefinitely (button returns to enabled state reliably after completion)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Polish Notifications UX and behavior: make permission state and outcomes clearer, keep the toggle state consistent with browser permission, and improve the in-app “New story today!” simulation banner styling to match the app’s overall theme (avoid clashing gradients).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "All enhance"
        ]
      },
      "acceptanceCriteria": [
        "Profile notifications section clearly communicates each state: unsupported browser, permission denied, permission granted, and permission not yet decided.",
        "If permission is denied, the toggle remains off/disabled and the inline explanation is actionable and easy to understand.",
        "Enabling notifications requests permission when needed and (when granted) shows the existing test notification content; disabling notifications updates UI immediately and persists via the existing user state mechanism.",
        "DailyStoryNotificationBanner styling is updated to match the app’s design system (Tailwind tokens/colors) and does not introduce a new conflicting color scheme.",
        "Service worker registration behavior remains intact; no changes break existing /sw.js registration and offline behavior."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Apply a consistent UI polish pass across Premium, Share, and Notifications surfaces to reduce visual inconsistency: align button variants, icon sizing, card padding, separators, and microcopy tone, and remove any accidental mixed styling that stands out from the rest of the app.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "All enhance"
        ]
      },
      "acceptanceCriteria": [
        "Premium, Share, and Notifications sections use consistent shadcn Button/Badge/Switch/Separator patterns and spacing scale.",
        "User-facing microcopy across these surfaces is consistent in tone and capitalization.",
        "No new user-facing strings are introduced in non-English."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose existing UI components instead).",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts or frontend/src/hooks/useActor.ts (immutable paths).",
    "Keep the Premium flow as a placeholder (no real payment processing).",
    "Do not add real push notification scheduling; remain within the browser Notifications API and existing in-app simulation approach.",
    "Preserve existing PWA service worker registration and /sw.js behavior."
  ],
  "nonGoals": [
    "Implementing Stripe or any real payment provider.",
    "Adding third-party authentication providers beyond Internet Identity.",
    "Building real-time messaging, push notification delivery, or server-driven notification scheduling.",
    "Adding new backend services or external databases."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}