{
  "kind": "build_request",
  "title": "Fix regression where buttons render as plain text (no visible button styling)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Investigate and fix the UI regression where some pages/components display only button text (no visible button styling), ensuring buttons render with the expected padding, border/background, hover/focus states, and are clearly recognizable as buttons in both Preview and Production builds.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Again this two only show no button only text why please help and create please solve my problem"
        ]
      },
      "acceptanceCriteria": [
        "On pages where primary CTAs exist (e.g., Premium subscribe actions, error fallback navigation, install prompt), the CTAs render as visually distinct buttons (not just plain text) with clear hit targets.",
        "Buttons show visible focus styling when tabbed to (keyboard navigation) and remain readable in both light and dark themes.",
        "The fix is verified in both Preview and Production builds (not only in local/dev mode)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a minimal, repeatable regression check in the UI to confirm button styling is present on at least two representative screens that previously exhibited the issue (for example: the Premium page subscribe button and the RouteErrorFallback “Go to Home” button).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Again this two only show no button only text why please help and create please solve my problem"
        ]
      },
      "acceptanceCriteria": [
        "There is a documented/manual checklist (or lightweight dev-only verification step) that developers can use to confirm buttons are visibly styled on the chosen screens after builds.",
        "The selected screens include at least two distinct button variants (e.g., default and outline/secondary/ghost) to catch missing styles across variants."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (read-only UI component sources must be composed/used, not modified).",
    "Do not modify frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx."
  ],
  "nonGoals": [
    "Do not add new product features or new pages beyond what is required to restore button visibility/styling.",
    "Do not change authentication behavior or backend logic as part of this fix."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}