{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix onboarding button reliability, post-onboarding navigation, and SW stale routing",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make onboarding Next/Get Started/Skip advance/complete/exit reliably and ensure buttons are clickable on all devices.",
      "acceptanceCriteria": [
        "On the onboarding screen, clicking/tapping \"Next\" on step 1 moves to step 2, and on step 2 moves to step 3 (verified visually by content + progress indicator).",
        "On step 3, clicking/tapping \"Get Started\" closes onboarding and shows the main app UI.",
        "Clicking/tapping \"Skip\" closes onboarding and shows the main app UI from any step.",
        "Buttons are not blocked by overlays (click/tap works on desktop and mobile)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/onboarding/OnboardingFlow.tsx",
          "operation": "modify",
          "description": "Replace direct shadcn Button usage with the app-owned AppButton wrapper to ensure reliable pointer/tap behavior and consistent disabled/pointer-events styling in production builds; also ensure action buttons use explicit type=\"button\" and are not prevented by any unintended default behaviors. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/onboarding/StepTransition.tsx",
          "operation": "modify",
          "description": "Ensure the transition wrapper cannot create an invisible overlay that intercepts taps/clicks during step changes (e.g., by confirming it only renders the current step and does not apply styles that block pointer events)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "After onboarding completion (Get Started/Skip), reliably transition to the main routed UI and navigate to Home (\"/\") if needed.",
      "acceptanceCriteria": [
        "After completing onboarding, the app displays the main layout (header/bottom navigation) and a routed page (Home at \"/\" if enforced).",
        "The route/state updates are reflected immediately without requiring a manual refresh."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the post-onboarding completion handler to reliably render the main layout and force a navigation to the Home route (\"/\") after onboarding is dismissed (via Get Started or Skip), so users never appear stuck on the onboarding screen or prior route."
        },
        {
          "path": "frontend/src/lib/onboarding.ts",
          "operation": "modify",
          "description": "Harden onboarding completion persistence to avoid edge cases where storage failures leave the app repeatedly showing onboarding; keep behavior backward-compatible and limited to ensuring completion is recorded/read reliably."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Adjust PWA/service worker caching so client-side route transitions never show stale content and new deployments update cleanly.",
      "acceptanceCriteria": [
        "With the service worker enabled, navigating between routes (e.g., Home -> Categories -> Category Detail -> Back) updates the UI to the correct page content every time.",
        "After a new deployment, the app updates cleanly (no persistent stale routes/pages due to cached navigation responses)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/sw.js",
          "operation": "modify",
          "description": "Update the service worker caching strategy to avoid serving stale navigation content: use a robust app-shell approach for navigations (serve index.html consistently for client-side routes without caching arbitrary navigation responses), and bump/rotate the cache version to ensure updates invalidate older cached shells after deployment."
        },
        {
          "path": "frontend/src/pwa/registerServiceWorker.ts",
          "operation": "modify",
          "description": "Improve update handling so new deployments replace older cached shells reliably (e.g., prompt immediate activation behavior already present, plus ensuring the app revalidates on focus/visibility changes and avoids getting stuck on an old controller state)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure service worker registration/update behavior does not interfere with in-app navigation rendering (e.g., confirm registration is not repeatedly re-triggered in a way that causes stale UI or blocked route updates)."
        }
      ]
    }
  ]
}