{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Polish Premium, Sharing, and Notifications UX (frontend-only)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make the Premium flow (Go Premium, Success, Profile, Drawer) more consistent, informative, and resistant to accidental repeated Subscribe actions while preserving the fake subscription behavior.",
      "acceptanceCriteria": [
        "Go Premium page has clearer plan presentation (Monthly vs Yearly) with consistent spacing/typography and improved visual hierarchy while keeping the same prices (₹99 monthly, ₹799 yearly) and placeholder disclaimer.",
        "Tapping Subscribe Now cannot trigger multiple navigations/updates from rapid repeated clicks (button shows a temporary loading/disabled state).",
        "Premium Success page provides clear next actions and keeps messaging consistent with existing success text intent.",
        "Profile shows an explicit Premium status section when isPremium=true (e.g., current plan label + benefits recap) and a clearer cancel flow (e.g., confirmation step) that still sets isPremium=false and updates UI immediately.",
        "Drawer and Profile Premium badge/crown styling remains consistent and legible in both light/dark themes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/GoPremium.tsx",
          "operation": "modify",
          "description": "Refactor Premium plan UI to include clearer Monthly vs Yearly comparison, explicit plan selection feedback (selected state), consistent hierarchy/spacing, and a placeholder disclaimer; add Subscribe Now loading/disabled state to prevent double-taps and multiple navigations. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/PremiumSuccess.tsx",
          "operation": "modify",
          "description": "Polish success layout and copy to match the Premium tone, improve next-action clarity (Home/Profile actions), and align visuals with the same Premium badge/theme patterns used elsewhere. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ProfileTab.tsx",
          "operation": "modify",
          "description": "Add an explicit Premium status section when isPremium=true (plan label + benefits recap) and implement a clearer cancel flow with a confirmation step that immediately updates UI and sets isPremium=false. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AppDrawer.tsx",
          "operation": "modify",
          "description": "Unify Premium badge/crown styling with Profile and other surfaces (consistent sizes/colors in light/dark) and ensure the Premium status indicator text remains legible. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/PremiumBadge.tsx",
          "operation": "create",
          "description": "Create a small reusable PremiumBadge component (Badge + Crown icon styling) to ensure consistent Premium visuals across Drawer/Profile/StoryCard. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure premium gating feels intentional: hide all ads for premium users consistently and make premium story indicators coherent and non-confusing across the UI with instant updates when toggling premium state.",
      "acceptanceCriteria": [
        "When isPremium=true, no AdPlaceholder renders anywhere it is used (banner or inline).",
        "Premium-related story indicators (e.g., StoryCard premium UI) are visually consistent with the Premium theme and do not show confusing lock/placeholder states.",
        "Switching between Free and Premium updates the UI immediately without requiring a refresh (ads, badges, premium indicators update instantly)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdPlaceholder.tsx",
          "operation": "modify",
          "description": "Harden ad hiding behavior for premium users by ensuring all internal render paths return null when isPremium=true and aligning styling/spacing to avoid layout jumps in mixed lists. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/StoryCard.tsx",
          "operation": "modify",
          "description": "Standardize premium story indicator styling using the shared PremiumBadge (and/or consistent icon sizing) and ensure the non-premium state does not show awkward placeholder/lock messaging; keep premium story labeling intentional and consistent. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useAppUser.ts",
          "operation": "modify",
          "description": "Ensure premium state changes reflect immediately in the UI for authenticated users as well (e.g., optimistic premium state while the existing persistence mechanism completes), so ads/badges/indicators update instantly without refresh. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Improve Share App and Share Story UX with explicit fallback actions, clear user feedback (success/cancel/failure), stable shared text formatting, and reliable button re-enabling after completion.",
      "acceptanceCriteria": [
        "Profile “Invite Friends – Share App” provides clear user feedback for success vs. cancel vs. failure (no silent failures).",
        "If Web Share API is unavailable, the UI offers an explicit copy-link action (not just an implicit fallback) and confirms success with a toast.",
        "Story share (ShareSheetPlaceholder/shareStory) includes: title, optional preview text when available, and a stable story URL when possible; the shared text formatting is readable in common share targets.",
        "Share actions do not block the UI indefinitely (button returns to enabled state reliably after completion)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/share.ts",
          "operation": "modify",
          "description": "Update sharing utilities to distinguish outcomes (success vs user-cancel vs failure) and to support an explicit copy-link action when Web Share API is unavailable; ensure callers can reliably reset loading state after completion. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ProfileTab.tsx",
          "operation": "modify",
          "description": "Polish “Invite Friends – Share App” to provide explicit feedback for success/cancel/failure; when Web Share API is unavailable, show a clear Copy Link action and toast confirmation; ensure share buttons always return to enabled state. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ShareSheetPlaceholder.tsx",
          "operation": "modify",
          "description": "Improve story share UX: show clear feedback for success/cancel/failure, ensure readable shared text that includes title + optional preview + stable URL, and guarantee the share button re-enables after completion. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Make Notifications UX clearer and consistent with browser permission state, improve the Daily story simulation banner styling to match app theme, and preserve existing service worker behavior.",
      "acceptanceCriteria": [
        "Profile notifications section clearly communicates each state: unsupported browser, permission denied, permission granted, and permission not yet decided.",
        "If permission is denied, the toggle remains off/disabled and the inline explanation is actionable and easy to understand.",
        "Enabling notifications requests permission when needed and (when granted) shows the existing test notification content; disabling notifications updates UI immediately and persists via the existing user state mechanism.",
        "DailyStoryNotificationBanner styling is updated to match the app’s design system (Tailwind tokens/colors) and does not introduce a new conflicting color scheme.",
        "Service worker registration behavior remains intact; no changes break existing /sw.js registration and offline behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProfileTab.tsx",
          "operation": "modify",
          "description": "Refactor Notifications section to explicitly represent unsupported/denied/granted/default states; keep toggle state consistent with Notification.permission (disabled/off when denied), request permission only when needed, show existing test notification on grant, and persist preference via existing user state mechanism. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/notifications.ts",
          "operation": "modify",
          "description": "Add/adjust notification permission helpers to support clearer state handling in the Profile UI (e.g., return current permission, distinguish default vs denied), without changing the existing test notification content behavior. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/DailyStoryNotificationBanner.tsx",
          "operation": "modify",
          "description": "Update banner styling to align with the app’s Tailwind tokens (background/border/text using theme colors) and remove the clashing purple/pink gradient while preserving dismiss logic and layout. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Apply a consistent UI polish pass across Premium, Share, and Notifications surfaces using existing shadcn patterns and consistent microcopy tone (English-only).",
      "acceptanceCriteria": [
        "Premium, Share, and Notifications sections use consistent shadcn Button/Badge/Switch/Separator patterns and spacing scale.",
        "User-facing microcopy across these surfaces is consistent in tone and capitalization.",
        "No new user-facing strings are introduced in non-English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/GoPremium.tsx",
          "operation": "modify",
          "description": "Align button variants, card padding, separators, and microcopy tone with the rest of the app (shadcn Button/Badge/Separator patterns) while keeping prices and placeholder disclaimer unchanged. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ProfileTab.tsx",
          "operation": "modify",
          "description": "Polish Premium/Share/Notifications sections for consistent spacing, icon sizing, separators, and capitalization; ensure all new microcopy remains English-only. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ShareSheetPlaceholder.tsx",
          "operation": "modify",
          "description": "Ensure the share button/loading state, icon sizing, and feedback messaging are consistent with other polished actions (Button patterns + consistent toast tone). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/PremiumBadge.tsx",
          "operation": "modify",
          "description": "Finalize shared Premium badge styling and variants to match light/dark themes and unify usage across Premium, Profile, Drawer, and story indicators. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}