{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Stabilize TanStack Router navigation and draft-preview not-found failures",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Audit and fix all in-app navigation entry points to use only valid TanStack Router routes and prefer route-template navigation for dynamic paths.",
      "acceptanceCriteria": [
        "Tapping each BottomNav tab (Home/Categories/Search/Favorites/Profile) never renders the \"Page Not Found\" screen.",
        "Tapping Categories (from Home category scroller and Categories tab grid) always opens the Category Detail screen for that category.",
        "Tapping any story card (Featured, Latest, Category Detail, Search results, Favorites, Continue Reading) always opens the Story Reader screen."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BottomNav.tsx",
          "operation": "modify",
          "description": "Ensure BottomNav navigation uses only valid routeTree paths and enhance its navigation handler to avoid string-built/dynamic mismatches; include current location in any failure logging."
        },
        {
          "path": "frontend/src/components/AppDrawer.tsx",
          "operation": "modify",
          "description": "Audit drawer menu link paths against App.tsx routeTree and update navigation handling so failures are logged once with both attempted path and current location."
        },
        {
          "path": "frontend/src/pages/ProfileTab.tsx",
          "operation": "modify",
          "description": "Audit all profile-related links (premium CTA, settings links, story editor navigation) to confirm they align with App.tsx routeTree and update navigation error handling to include attempted path and current location."
        },
        {
          "path": "frontend/src/components/CategoryScroller.tsx",
          "operation": "modify",
          "description": "Harden category chip navigation to always use route-template navigation to '/categories/$categoryId' with encoded params, and add safe error handling/logOnce for navigation failures."
        },
        {
          "path": "frontend/src/pages/CategoriesTab.tsx",
          "operation": "modify",
          "description": "Ensure category grid navigation always uses route-template navigation to '/categories/$categoryId' with encoded params, and add safe error handling/logOnce for navigation failures."
        },
        {
          "path": "frontend/src/components/StoryCard.tsx",
          "operation": "modify",
          "description": "Ensure all story-card navigation uses route-template navigation to '/story/$storyId' and add guarded navigation with logOnce so clicks cannot silently route to not-found on errors."
        },
        {
          "path": "frontend/src/components/ContinueReadingCard.tsx",
          "operation": "modify",
          "description": "Ensure continue-reading navigation uses route-template navigation to '/story/$storyId' and add guarded navigation with logOnce to prevent not-found due to navigation exceptions."
        },
        {
          "path": "frontend/src/components/MyStoryCard.tsx",
          "operation": "modify",
          "description": "Guard read/edit navigation with logOnce (attempted path + current location) and ensure route-template navigation is consistently used for '/story/$storyId' and '/story/editor/$storyId'."
        },
        {
          "path": "frontend/src/components/AdPlaceholder.tsx",
          "operation": "modify",
          "description": "Guard premium CTA navigation to '/premium' with logOnce diagnostics so any preview-only navigation failures are captured without spamming logs."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make Story Reader and Category Detail route param parsing resilient to invalid/malformed params and show friendly in-app fallback UI instead of router error/not-found.",
      "acceptanceCriteria": [
        "Navigating to an invalid story route (e.g., `/story/not-a-number`) shows a friendly in-app error state (in English) with a working button to return to Home, and does not render a blank page.",
        "Navigating to an invalid category route (e.g., `/categories/%` or an undecodable value) shows a friendly in-app error state (in English) with a working button to return to Categories/Home, and does not render a blank page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/StoryReader.tsx",
          "operation": "modify",
          "description": "Replace direct BigInt(storyId) usage with safe parsing/validation of the route param; when invalid, render a friendly in-app error state with a working 'Go Home' action and avoid throwing into the router fallback."
        },
        {
          "path": "frontend/src/pages/CategoryDetail.tsx",
          "operation": "modify",
          "description": "Wrap categoryId decoding in a safe try/catch (or equivalent) so malformed/undecodable values render a friendly in-app error state with a working action to return to Categories/Home, rather than throwing into the router fallback."
        },
        {
          "path": "frontend/src/lib/urlParams.ts",
          "operation": "modify",
          "description": "Harden decodeCategoryId to avoid throwing on malformed input (e.g., return a safe sentinel or expose a safeDecode helper) so callers can render controlled fallback UI instead of crashing the route."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add lightweight runtime diagnostics for navigation failures and RouteErrorFallback renders using the existing logOnce pattern.",
      "acceptanceCriteria": [
        "If a navigation attempt fails (exception), the app logs a single `logOnce` entry including the target path.",
        "If the RouteErrorFallback is rendered, the app logs a single `logOnce` entry including the current pathname/search that led to it."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RouteErrorFallback.tsx",
          "operation": "modify",
          "description": "When the fallback screen renders, log a single concise logOnce entry including the current pathname and search so broken links can be identified quickly without spamming."
        },
        {
          "path": "frontend/src/components/BottomNav.tsx",
          "operation": "modify",
          "description": "Augment existing navigation try/catch diagnostics to logOnce exactly once per target path and include both attempted path and current pathname/search."
        },
        {
          "path": "frontend/src/components/AppDrawer.tsx",
          "operation": "modify",
          "description": "Augment existing navigation try/catch diagnostics to logOnce exactly once per target path and include both attempted path and current pathname/search."
        },
        {
          "path": "frontend/src/pages/ProfileTab.tsx",
          "operation": "modify",
          "description": "Augment existing navigation try/catch diagnostics to logOnce exactly once per target path and include both attempted path and current pathname/search."
        },
        {
          "path": "frontend/src/components/StoryCard.tsx",
          "operation": "modify",
          "description": "Add logOnce diagnostics for any navigation exceptions from story-card clicks, including attempted path and current pathname/search."
        },
        {
          "path": "frontend/src/components/ContinueReadingCard.tsx",
          "operation": "modify",
          "description": "Add logOnce diagnostics for any navigation exceptions from continue-reading interactions, including attempted path and current pathname/search."
        },
        {
          "path": "frontend/src/components/CategoryScroller.tsx",
          "operation": "modify",
          "description": "Add logOnce diagnostics for any navigation exceptions from category chips, including attempted path and current pathname/search."
        },
        {
          "path": "frontend/src/pages/CategoriesTab.tsx",
          "operation": "modify",
          "description": "Add logOnce diagnostics for any navigation exceptions from category grid items, including attempted path and current pathname/search."
        }
      ]
    }
  ]
}