{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Redeploy guidance + live URL surfacing in UI",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a redeploy checklist (frontend-local documentation) so a fresh ICP deployment can be performed reliably.",
      "acceptanceCriteria": [
        "A new live version is successfully deployed (no build/deploy failures).",
        "The deployed app loads in the browser and reaches the main UI without runtime errors."
      ],
      "file_operations": [
        {
          "path": "frontend/DEPLOYMENT.md",
          "operation": "create",
          "description": "Document the ICP redeploy workflow for this project (build, deploy, and verification steps), including where to find the resulting production URL after deployment."
        },
        {
          "path": "frontend/src/lib/liveAppUrl.ts",
          "operation": "create",
          "description": "Add a small utility that computes the current live app URL from the browser location (with an optional build-time override via env var) so the UI can display/copy a consistent production link after redeploy."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Surface the active live app URL in the UI in English with an easy copy action.",
      "acceptanceCriteria": [
        "The response includes the new/active live URL for the redeployed version.",
        "The URL is clearly labeled as the live/production link."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/LiveAppUrlCard.tsx",
          "operation": "create",
          "description": "Create a small card component that shows a clearly labeled \"Live (production) URL\" in English and provides a copy-to-clipboard action with a simple success/failure message. Use existing shadcn/ui primitives already in the repo (e.g., Button/Card) for consistent styling. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/HelpAndSupport.tsx",
          "operation": "modify",
          "description": "Render the new LiveAppUrlCard on the Help & Support page so users can always find and copy the updated production link after redeploy."
        }
      ]
    }
  ]
}