{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Polish pass across Premium, Sharing, and Notifications surfaces",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Polish the Premium upgrade flow and premium status/cancellation messaging across Go Premium, Premium Success, Profile, and Drawer while preserving placeholder subscription behavior.",
      "acceptanceCriteria": [
        "Go Premium page has clearer plan selection state and comparison (e.g., visual emphasis, selected indicator) before/while subscribing, without changing the placeholder subscription behavior.",
        "Subscribe actions are protected against accidental repeated taps (no duplicate navigations / repeated state changes when tapped quickly).",
        "Premium status surfaces in Profile and Drawer use consistent wording and hierarchy (e.g., “Premium Active”, “Premium Member”) and cancellation action is clearly labeled.",
        "All user-facing text introduced/updated for this polish is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/GoPremium.tsx",
          "operation": "modify",
          "description": "Improve plan comparison hierarchy (clearer monthly vs yearly comparison, selected indicator), add explicit selection feedback before subscribe, and harden Subscribe against rapid repeated taps by disabling both plan cards and buttons while subscribing. Preserve the existing fake subscription simulation and navigation flow. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/PremiumSuccess.tsx",
          "operation": "modify",
          "description": "Refine copy and layout hierarchy to clearly confirm Premium activation and next steps; ensure wording matches Profile/Drawer (e.g., “Premium Active”) and keep all microcopy in English. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ProfileTab.tsx",
          "operation": "modify",
          "description": "Make Premium status and cancellation UX clearer and consistent (labeling, hierarchy, destructive vs secondary button variants) while keeping the existing placeholder cancellation (local state). Ensure all new/updated text is English. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AppDrawer.tsx",
          "operation": "modify",
          "description": "Align premium status wording and hierarchy with Profile (e.g., “Premium Active” / “Premium Member”) and polish the non-premium upsell row so it matches app button/icon sizing conventions. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure ads are consistently hidden for premium users and make premium-only story locked states feel intentional and user-friendly.",
      "acceptanceCriteria": [
        "When the user is premium, ad UI elements do not render in any known placements (including banner/inline/interstitial placeholder surfaces).",
        "When the user is not premium, ad placeholders render consistently and do not cause layout jumps when toggling premium state.",
        "Any premium-only story indicators or locked states have a consistent, intentional presentation (clear label/CTA), without blank or broken-looking spaces."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/InterstitialAdModal.tsx",
          "operation": "modify",
          "description": "Hide/disable interstitial ad placeholder for premium users by checking premium state before rendering, and ensure countdown state resets cleanly when reopened to avoid awkward transitions. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AdPlaceholder.tsx",
          "operation": "modify",
          "description": "Standardize ad placeholder sizing and container styles across variants to prevent layout jumps and to keep spacing consistent when toggling premium state; keep the existing behavior of returning null for premium users. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/HomeTab.tsx",
          "operation": "modify",
          "description": "Audit known banner/inline ad placements and ensure they render only for non-premium users using a consistent wrapper/padding so layout remains stable. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/StoryReader.tsx",
          "operation": "modify",
          "description": "Replace the current premium story message (“Premium unlocked”) with an intentional locked-state callout when a story is premium and the user is not premium (clear label + CTA to Go Premium), avoiding broken/placeholder-looking space. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/StoryCard.tsx",
          "operation": "modify",
          "description": "Polish premium indicators/locked affordances for premium stories when the user is not premium (consistent badge/label and CTA language) so it feels intentional and consistent across lists and featured cards. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Polish Share App and Share Story UX with clear feedback for success/cancel/failure and an explicit copy-link fallback when system sharing is unavailable.",
      "acceptanceCriteria": [
        "If system share succeeds, the user gets a clear success toast/message; if the user cancels or sharing fails, the UI responds gracefully (no silent failure, no console-only errors).",
        "When Web Share API is unavailable, the UI explicitly offers a visible copy-link action and communicates the result (copied/failed).",
        "Share buttons show a clear loading/disabled state while share is in progress and return to normal after completion."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/share.ts",
          "operation": "modify",
          "description": "Adjust share utilities to expose explicit share outcomes (success/cancelled/failed) and provide a clear, reusable copy-link helper for both app and story sharing without relying on console-only feedback. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ProfileTab.tsx",
          "operation": "modify",
          "description": "Update Share App UX to: show disabled/loading state during share, display explicit toasts/messages for success/cancel/failure, and present a clearly discoverable copy-link action when Web Share API is unavailable (including copied/failed messaging). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ShareSheetPlaceholder.tsx",
          "operation": "modify",
          "description": "Polish Share Story control to handle success/cancel/failure with user-facing feedback (no console-only errors), show a clear loading/disabled state while in progress, and provide an explicit copy-link fallback UI when Web Share API is unavailable. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/StoryReader.tsx",
          "operation": "modify",
          "description": "Ensure Share Story interactions in both header and footer use the polished sharing behavior (including fallback copy-link when needed) and remain disabled while a share is in progress to prevent double actions. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Polish Notifications UX: keep toggle state consistent with browser permission, clarify outcomes, and restyle the “New story today!” banner to match the app theme.",
      "acceptanceCriteria": [
        "The notifications toggle cannot appear enabled when browser permission is denied; the UI clearly explains how to enable notifications in browser settings when denied.",
        "When permission is granted, enabling notifications provides clear confirmation; when permission is not granted, the UI clearly communicates the outcome (granted/denied/dismissed).",
        "The “New story today!” banner styling matches the app theme and no longer uses a clashing gradient; spacing/typography aligns with other top-of-screen banners.",
        "All notification-related user-facing text introduced/updated for this polish is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProfileTab.tsx",
          "operation": "modify",
          "description": "Make notifications toggle derived from real browser permission (cannot be on when denied), add clear explanatory copy for denied state with guidance to enable in browser settings, and show explicit user feedback for granted/denied/dismissed outcomes—all in English. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/notifications.ts",
          "operation": "modify",
          "description": "Refine notification helpers to provide clearer permission-state semantics for the UI (including distinguishing denied vs dismissed/default) while keeping behavior within the browser Notification API constraints. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/DailyStoryNotificationBanner.tsx",
          "operation": "modify",
          "description": "Restyle the “New story today!” banner to use theme-aligned background/border/text (remove clashing gradient) and align spacing/typography with other top-of-screen banners. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/HomeTab.tsx",
          "operation": "modify",
          "description": "Ensure the notification simulation banner render conditions and messaging align with the polished permission UX (consistent with Profile), without introducing new notification features. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Apply a consistent UI polish pass across Premium, Share, and Notifications surfaces (buttons, icons, padding, separators, typography, and microcopy tone).",
      "acceptanceCriteria": [
        "Across Go Premium, Premium Success, Profile, Drawer premium upsell, sharing UI, and notifications UI: button variants and sizes are consistent for similar actions (primary vs secondary vs destructive).",
        "Icon sizes and spacing are consistent within cards/rows (no mismatched icon sizing between adjacent actions).",
        "Card padding, separators, and typography scale look consistent across the polished screens.",
        "Microcopy tone is consistent and professional in English (no mixed tone like playful in one place and formal elsewhere unless intentionally applied consistently)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/uiPolish.ts",
          "operation": "create",
          "description": "Add shared, lightweight UI polish constants/helpers (e.g., standard icon size classnames, card padding presets, row spacing) to reduce inconsistent styling across Premium/Share/Notifications surfaces. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/GoPremium.tsx",
          "operation": "modify",
          "description": "Align button variants/sizes (primary vs secondary), icon sizing, card padding, separators, and microcopy tone with the shared polish guidelines/constants. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/PremiumSuccess.tsx",
          "operation": "modify",
          "description": "Standardize button hierarchy, icon sizing, card spacing, and microcopy tone to match the polished Premium experience. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ProfileTab.tsx",
          "operation": "modify",
          "description": "Normalize section card padding/separators, action button variants (including destructive cancellation), icon sizing, and microcopy tone across Premium/Share/Notifications blocks. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AppDrawer.tsx",
          "operation": "modify",
          "description": "Align drawer premium upsell row/button styling, icon sizing, spacing, and separators with the same conventions used on Profile and Go Premium. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ShareSheetPlaceholder.tsx",
          "operation": "modify",
          "description": "Align share button styling (variant/size), icon sizing, and loading/disabled visuals with other action buttons used across the app. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/DailyStoryNotificationBanner.tsx",
          "operation": "modify",
          "description": "Align banner spacing, typography, and icon/button sizing with the app’s standard top-of-screen banners and overall theme. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "If needed, add/adjust minimal global utility classes that support consistent spacing/typography for the polished surfaces (without introducing new stylesheet entry points). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}