{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore shadcn/Tailwind button styling across builds and add a lightweight regression check",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix the regression causing buttons to render as plain text by restoring correct Tailwind/shadcn token formatting and ensuring button variants retain visible styling in Preview and Production builds.",
      "acceptanceCriteria": [
        "On pages where primary CTAs exist (e.g., Premium subscribe actions, error fallback navigation, install prompt), the CTAs render as visually distinct buttons (not just plain text) with clear hit targets.",
        "Buttons show visible focus styling when tabbed to (keyboard navigation) and remain readable in both light and dark themes.",
        "The fix is verified in both Preview and Production builds (not only in local/dev mode)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Fix CSS variable token formatting to match Tailwind's `oklch(var(--token) / <alpha-value>)` expectations (store raw OKLCH channels like `L C H`, not nested `oklch(...)`), so button backgrounds/borders/text colors render correctly across builds."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Harden Tailwind scanning for Production builds (ensure content globs reliably cover all `src/**/*` files) and add a minimal safelist for key button-variant utility classes used by shadcn button variants to prevent accidental purging in optimized builds."
        },
        {
          "path": "frontend/src/components/InstallPromptBanner.tsx",
          "operation": "modify",
          "description": "Ensure both the install CTA and the dismiss control are rendered with clearly button-like styling (compose using existing shadcn-ui `Button` patterns where appropriate, without modifying any files under `frontend/src/components/ui`). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a minimal, repeatable regression check developers can use to confirm button styling is present on at least two representative screens (Premium and RouteErrorFallback) and covers at least two button variants.",
      "acceptanceCriteria": [
        "There is a documented/manual checklist (or lightweight dev-only verification step) that developers can use to confirm buttons are visibly styled on the chosen screens after builds.",
        "The selected screens include at least two distinct button variants (e.g., default and outline/secondary/ghost) to catch missing styles across variants."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ButtonStyleRegressionCheck.tsx",
          "operation": "create",
          "description": "Create a small dev-only UI fragment that renders at least two shadcn `Button` variants (e.g., default + outline/ghost) with a short on-screen instruction to visually confirm padding/background/border/hover/focus states are present. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/GoPremium.tsx",
          "operation": "modify",
          "description": "Wire the dev-only regression check onto the Premium screen near the subscribe CTAs so developers can quickly confirm both default and outline button variants are styled after Preview/Production builds. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/RouteErrorFallback.tsx",
          "operation": "modify",
          "description": "Wire the dev-only regression check onto the error fallback screen (alongside the existing 'Go to Home' CTA) to validate button styling on a second representative screen. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a lightweight developer-facing manual checklist reference (dev-only) accessible during testing (e.g., a console message or small hidden note gated by `import.meta.env.DEV`) describing the two screens to verify and the expected visible button styling."
        }
      ]
    }
  ]
}