{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Left-side drawer navigation and header logo for the existing React PWA",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a persistent app header to the post-splash/onboarding layout with a hamburger button and logo.",
      "acceptanceCriteria": [
        "When the user is past Splash + Onboarding, a header is visible above the current page content.",
        "The header includes a hamburger/menu button on the left and a logo image.",
        "Header does not appear on SplashScreen or OnboardingFlow screens."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AppHeader.tsx",
          "operation": "create",
          "description": "Create an AppHeader component that renders a top app bar with a left hamburger button and a logo image. Use shadcn/ui primitives (e.g., Button) for consistent styling; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Integrate AppHeader into the main RootLayout that currently renders BottomNav, ensuring it is only rendered after SplashScreen and OnboardingFlow have completed (i.e., within the existing post-splash/onboarding return branch)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Implement a left-side drawer that opens from the header hamburger button and closes via explicit close and selection actions.",
      "acceptanceCriteria": [
        "Clicking/tapping the hamburger button opens a left-side drawer.",
        "The drawer can be closed without navigation (close button or outside click) and closes after selecting a menu item.",
        "Drawer open/close behavior works on mobile and desktop widths."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AppDrawer.tsx",
          "operation": "create",
          "description": "Create an AppDrawer component implementing a controlled left-side slide-in panel. Use a shadcn/ui overlay/drawer pattern (e.g., Sheet) to support outside-click close and an explicit close control; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AppHeader.tsx",
          "operation": "modify",
          "description": "Wire the hamburger button to control AppDrawer open/close state, and pass handlers so the drawer can close via explicit close and after a navigation item is selected. Use shadcn/ui Button/icon patterns; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add TanStack Router navigation items in the drawer for existing routes and indicate the active route.",
      "acceptanceCriteria": [
        "Each drawer menu item navigates to the correct existing route using TanStack Router navigation APIs.",
        "The current route is visually indicated as active inside the drawer menu.",
        "No routes are removed or renamed."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AppDrawer.tsx",
          "operation": "modify",
          "description": "Add drawer menu items for Home (/), Categories (/categories), Search (/search), Favorites (/favorites), Profile (/profile), and Premium (/premium). Use TanStack Router navigation APIs (e.g., useNavigate) and router state (e.g., useRouterState) to navigate and style the active item; close the drawer after selection."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Integrate header + drawer without breaking BottomNav, ensure content layout accounts for header, and keep StoryReader usable.",
      "acceptanceCriteria": [
        "BottomNav remains visible and functional as before.",
        "Main page content is scrollable and not obscured by the new header.",
        "StoryReader and other full-screen experiences still render correctly with the new layout."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Adjust RootLayout structure so the header sits above the scrollable main content area (no content hidden under the header) while retaining the existing fixed BottomNav and its spacing (pb-16). Add route-aware layout behavior if needed so StoryReader continues to render as a full-screen experience without visual conflicts."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Use an existing/generated static logo asset for the header logo via frontend static files, consistent with PWA icon conventions.",
      "acceptanceCriteria": [
        "The header logo is served as a static asset (e.g., under frontend/public/assets/generated).",
        "The app builds successfully without requiring any backend changes to serve the logo.",
        "Logo renders crisply in both light and dark themes (no unreadable blending)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AppHeader.tsx",
          "operation": "modify",
          "description": "Reference the static logo asset at frontend/public/assets/generated/gtu-logo.dim_512x512.png for the header logo (matching the manifest icon convention) and style it to remain legible in light/dark themes; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}